[Language]
DisplayName=Vietnamese

[500]
500=***Section use for Bot messages and splash***
1=Không chạy/Biên dịch Script như (x64)! Hãy thử Chạy/Biên dịch Script như (x86) để có được các bot làm việc.\r\nNếu thông điệp này vẫn xuất hiện, cố gắng cài đặt lại AutoIt.
2=Bằng cách sử dụng các dòng lệnh (hoặc một phím tắt) bạn có thể bắt đầu nhiều Bots:\r\n     MyBot.run.exe [ProfileName] [EmulatorName] [InstanceName]\r\n\r\nVới các tham số dòng lệnh đầu tiên, chỉ định Tên Profile (bạn có thể tạo hồ sơ trên tab Bot/Profiles, nếu 1 tên Profile chứa 1 {không gian}, hãy gửi kèm theo các Tên Profile trong dấu ngoặc kép). Với thứ 2, xác định tên của các Giả lập và với thứ 3, 1 Trường hợp Android (không cho BlueStacks). \r\nGiả lập được hỗ trợ là MEmu, Droid4X, Nox, BlueStacks2, BlueStacks, KOPlayer và LeapDroid.\r\n\r\nCác ví dụ:\r\n     MyBot.run.exe MyVillage BlueStacks2\r\n     MyBot.run.exe "My Second Village" MEmu MEmu_1
3=%s
4=%s (trường hợp %s)
5=My Bot cho %s đang chạy.\r\n\r\n
6=My Bot với Profile %s đang chạy trong %s.\r\n\r\n
7=Tìm thấy chạy %s %s
8=Cấu hình Giả lập Android: %s
9=Android Shield không có sẵn cho %s
20=, Profile: %s
21=Khởi động Android...
22=Phát hiện Android...
23=Đang tải GUI Main...
24=Đang tải GUI Bottom...
25=Đang tải tab General...
26=Đang tải tab Village...
27=Đang tải tab Attack...
28=Đang tải tab Bot...
29=Đang tải tab About Us...
30=Khởi động GUI...
31=Hiện bot
32=Ẩn khi giảm thiểu
33=Hỗ trợ Development
34=About
35=Thoát
36=Đóng bot trước...
37=Đang tải tab MOD...

[600]
600=***Section use for Tab Name***
0=TAB Name
1=Nhật Ký
2=Làng
3=Kế Hoạch Attack
4=Bot
5=About Us
6=Linh Tinh
7=Req. && Donate
8=Nâng Cấp
9=Thành Tích
10=Thông Báo
11=Request Quân
12=Donate Quân
13=Lịch Donations
14=Laboratory
15=Heroes
16=Công Trình
17=Walls
18=PushBullet/Telegram
19=Hướng Dẫn
20=Troops
21=Spells
22=Boost
23=Nhà Hoang
24=Nhà Sống
25=TH Snipe
26=Bully
27=Tùy chọn
28=Search
29=Tấn Công
30=Thoát Trận
31=Collectors
32=Cài Đặt Cup
33=Tải Chiến Lược
34=Lưu Chiến Lược
35=Tùy Chọn
36=Profiles
37=Thống Kê
38=Gain
39=Misc
40=Attacks
41=Đào Tạo Quân
42=Tìm && Tấn Công
43=Chiến Lược
44=A - Cấu trúc
45=B - Điều kiện
46=C - Tấn công
47=D - Sau khi Vắt sữa
48=Nâng Cao
49=Note: Chiến lược này đã tắt, đánh dấu vào dấu kiểm trên
50=để kích hoạt nó!
51=Debug
52=Troops/Spells
53=Android
54=Thứ Tự Đào Tạo
55=Donations
56=SmartZap
57=DocOC
58=Misc MODs
59=Humanization
60=Goblin XP

[601]
601=***Section use for General***
2=NHẬT KÝ BOT
3=Log Style
4=Sử dụng các tùy chọn để thiết lập kiểu Nhật ký.
5=Tự động thay đổi size
6=Bot và Attack Log cùng size
7=Lớn Bot Log, Nhỏ Attack Log
8=Nhỏ Bot Log, Lớn Attack Log
9=Full Bot Log, Ẩn Attack Log
10=Ẩn Bot Log, Full Attack Log
11=Xóa Atk. Log
12=Sử dụng điều này để làm sạch Nhật ký Auto.
13=Copy vào Clipboard
14=Sử dụng điều này để sao chép Nhật ký Auto vào Clipboard (CTRL+C)
15=NHẬT KÝ TẤN CÔNG
16=---------------------------  LOOT --------       ----- BONUS ------
17=_TIME|TROP.|SEARCH|   GOLD| ELIXIR|DARK EL|TR.|S|  GOLD|ELIXIR|  DE|L.
18=Paypal Donate?
19=Hỗ trợ development
199=Tùy Chọn

[602]
602=***Section use for General Bottom***
0=- freeware bot -
1=Khởi Động Bot
2=Dừng Lại Bot
3=Tạm Dừng
4=Sử dụng điều này để Tạm Dừng tất cả các hành động của các bot cho đến khi bạn Tiếp Tục (hoặc Pause/Break key).
5=Tiếp Tục
6=Sử dụng để Tiếp Tục một Bot tạm dừng. (hoặc Pause/Break key).
7=Tìm Kiếm
8=Không tấn công. Tìm kiếm một Làng đáp ứng điều kiện.
9=Photo
10=Click vào đây để có một ảnh chụp ngôi làng của bạn và lưu nó vào một tập tin.
11=Ẩn
12=Sử dụng để di chuyển các cửa sổ Android ra khỏi tầm nhìn.
13=(Không giảm thiểu, nhưng ẩn)
14=Chế Độ Nền
15=Chế Độ
16=Kiểm tra này là Bật Chế Độ Nền của Bot.
17=Với điều này bạn cũng có thể ẩn các cửa sổ Giả lập Android khỏi tầm mắt.
18=DB Attack!
19=LB Attack!
20=TH Snipe!
22=Thống Kê Làng
23=sẽ xuất hiện ở đây
24=trên chạy đầu tiên.
25=Chuyển đổi giữa các thông tin làng và số liệu thống kê
26=Hiện
27=Dock
28=Undock
29=Sử dụng điều này để nhúng Window Android vào Bot.
30=Sử dụng điều này để BẮT ĐẦU bot.
31=Sử dụng điều này để DỪNG LẠI bot (or ESC key).
34=Hỗ trợ
35=Hỗ trợ tất cả các phiên bản Mod Mybot.
100=Gỡ lỗi
101=Sử dụng tính năng này để tạo một zip với các thư mục cần thiết để báo cáo sự cố!.

[603]
603=***Section use for Commun Value***
0=None
1=Nothing
2=Nút này sẽ dọn dẹp, hoặc thiết lập toàn bộ hàng của hộp
3=AM
4=PM
5=Search
6=sec.
7=second
8=seconds
9=Min
10=min.
11=search(es).
12=%
13=-
14=Hours
15=Hour
16=Su
17=Sunday
18=Mo
19=Monday
20=Tu
21=Tuesday
22=We
23=Wednesday
24=Th
25=Thursday
26=Fr
27=Friday
28=Sa
29=Saturday
30=Chỉ trong những giờ mỗi ngày
31=Chỉ trong những ngày trong tuần
32=Village
35=Hour:
36=Day
37=hrs
38=hr
39=Level

[604]
604=***Section use for Troops***
1=Barbarians
2=Archers
3=Giants
4=Goblins
5=Wall Breakers
6=W.Breakers
7=Balloons
8=Wizards
9=Healers
10=Dragons
11=Pekkas
12=P.E.K.K.A.s
13=Minions
14=Hog Riders
15=Valkyries
16=Golems
17=Witches
18=Lava Hounds
19=Bowlers
20=Baby Dragons
21=Miners

[605]
605=***Section use for Spell***
1=Lightning Spell
2=Healing Spell
3=Rage Spell
4=Jump Spell
5=Freeze Spell
6=Poison Spell
7=EarthQuake Spell
8=Haste Spell
9=Poison
10=EarthQuake
11=Haste
12=Clone Spell
13=Skeleton Spell
14=Skeleton
15=Lightning
16=Heal
17=Rage
18=Jump
19=Freeze

[606]
606=***Section use for Tab End Battle***
1=Thoát Trận Đấu
2=Khi ko có tài nguyên mới
3=Kết thúc trận đấu nếu không có tài nguyên phụ lục soát trong số này của giây.
4=Đếm ngược được bắt đầu sau khi tất cả Quân và Hoàng gia được triển khai trong trận đấu.
5=thu được sau
7=Và Tài nguyên dưới
8=Kết thúc trận đấu nếu Gold dưới số tiền này.
9=Khi không có tài nguyên
10=Kết thúc trân đấu khi tất cả Gold, Elixir và Dark Elixir = 0
11=Khi Một sao là thắng
12=Sẽ kết thúc trận đấu khi 1 sao nhận được
13=Khi Hai sao là thắng
14=Sẽ kết thúc trận đấu khi 2 sao nhận được
15=Tùy chọn kết thúc trận đấu DE side
16=Tấn công Dark Elixir Side, Tùy chọn Kết thúc trận
17=Cho phép chọn pha đối mặt với DE trong Triển khai Nhà Sống - Tấn Công On: tùy chọn
18=Khi bên dưới
19=Cho phép điều kiện đặc biệt để tấn công phía Dark Elixir.
20=Nếu không có bộ lọc bổ sung được chọn sẽ kết thúc trận đấu khi dưới Phần trăm Tổng Dark Elixir.
21=Tùy chọn Disable thông thường Trận đấu cuối
22=Tùy chọn Vô hiệu hoá thông thường Trận đấu cuối cùng khi pha đối mặt với DE được tìm thấy.
23=Sẽ kết thúc trận khi dưới min DE và 1 Sao được chiến thắng.
24=Khi
25=Sẽ kết thúc trận khi dưới min DE và King là yếu
26=là yếu
27=Sẽ kết thúc trận khi dưới min DE và Queen là yếu
28=Chuyển Tấn công DB ở END
29=Đặt % trại quân đội trước khi kích hoạt tùy chọn này
30=Khi Tỷ Lệ % là
31=Kết Thúc Trận Đấu nếu Tỷ Lệ % Tổng Thiệt Hại là trên
32=trên
33=Khi Tỷ Lệ % không
34=Kết Thúc Trận Đấu khi Tỷ Lệ % không thay đổi trong
35=thay đổi trong

[607]
607=***Section use for Tab Scripted Attack***
1=Triển Khai
2=IMG
3=Làm cho IMG với thông tin bổ sung trong Hồ Sơ -> Temp Thư mục
4=Chọn kịch bản; Bạn có thể chỉnh sửa/thêm các kịch bản mới nằm trong thư mục: 'CSV/Attack'
5=Tải lại Tập tin Script
6=Hiện/Chỉnh sửa Tấn Công Script
7=Tạo một Tấn Công Script mới
8=Sao chép Tấn Công Script hiện tại cho một tên mới
9=ImgLoc Raw Redline (mặc định)|ImgLoc Redline Drop Points|Original Redline|External Edges
10=Lựa chọn Redline thực hiện. ImgLoc Redline là mặc định và tốt nhất.
11=Drop line fix outer corner|Drop line fist Redline point|Full Drop line fix outer corner|Full Drop line fist Redline point|No Drop line
12=Chọn các cạnh thả dòng. Mặc định là góc ngoài và an toàn hơn. Đầu tiên điểm Redline có thể cải thiện cuộc tấn công.
34=Attack Now !
35=CSV Deployment Speed

[608]
608=***Section use for Tab Standard Attack***
1=Triển Khai
2=Thứ Tự Thả Quân
3=Tấn Công
4=Tấn công một mặt duy nhất, xuyên thấu qua cơ sở
5=Tấn công hai bên, xuyên thấu qua cơ sở
6=Tấn công ba mặt, được bên ngoài và một số bên trong của cơ sở
7=Chọn số của bên tấn công trên.
8=một hướng
9=hai hướng
10=ba hướng
11=tất cả các hướng
12=Delay Unit
13=Điều này trì hoãn việc triển khai quân đội, 1 (nhanh) = như một Bot, 10 (chậm) = Giống như một con người.
14=Ngẫu nhiên sẽ làm cho bot đa dạng hơn và gần gũi hơn với một người.
15=Sóng
16=Ngẫu Nhiên Delay Đơn Vị && Sóng
17=Sử Dụng Tấn Công Thông Minh: Gần Kẻ Đỏ.
18=Sử dụng thông minh tấn công để phát hiện bên ngoài 'Kẻ Đỏ' của làng để tấn công. Và thả quân của bạn gần với nó.
19=Kiểu Thả
20=Chọn chế độ triển khai Quân cho những đợt sóng.
21=Loại 1: Thả quân một làn sóng duy nhất mỗi bên sau đó chuyển quân, HOẶC
22=Loại 2: Thả tất cả quân một làn sóng đầy đủ (e.g. giants, barbs và archers) mỗi bên sau đó đổi bên.
23=Bên, sau đó Quân
24=Quân, sau đó Bên
25=Mặc định(Tất cả Quân)
26=Thả quân gần Gold Mines
27=Thả quân gần Elixir Collectors
28=Thả quân gần Dark Elixir Drills
29=Tấn công phía đơn gần nhất với Dark Elixir Storage
30=Tấn công phía đơn gần nhất với Townhall
31=Tấn công Bên DE
32=Tấn công Bên TH
33=Chọn lệnh quân thả cài sẵn.
34=Mỗi tùy chọn triển khai quân theo một thứ tự khác nhau và sóng khác nhau
35=Chỉ có quân được chọn trong "chỉ thả những quân này" tùy chọn sẽ được giảm

[609]
609=***Section use for Tab Trophy Setting***
1=Cài Đặt Cup
2=Phạm Vi Cup
3=MIN: Bot sẽ hạ Cup cho đến khi giá trị dưới sau.
4=MAX: Bot sẽ hạ Cup nếu số Cup của bạn lớn hơn giá trị này.
5=Sử dụng Heroes Để Hạ Cup
6=Sử dụng Heroes Hạ Cup nếu Heroes có sẵn.
7=Tấn công Nhà Hoang Khi Đang Hạ Cup
8=Tấn công Nhà Hoang tìm thấy trên các tìm kiếm đầu tiên trong khi hạ Cup.
9=Chờ cho đến khi quân
10=Nhập số phần trăm quân đầy đủ yêu cầu để tấn công nhà hoang trước khi bắt đầu hạ cúp.
11=Hero Ưu Tiên
12=Thiết lập thứ tự mà Bot giảm đầu tiên khi Hero có sẵn.

[610]
610=***Section use for Village Misc***
1=Dừng Tấn Công
2=Sử dụng các tùy chọn để thiết lập khi các bot sẽ ngừng tấn công.
3=Dừng Tấn Công
4=Dừng Bot
5=Đóng Bot
6=Đóng CoC+Bot
7=Tắt PC
8=Ngủ PC
9=Khởi Động PC
10=Khi...
11=G và E Full và Max.Cup
12=(G và E) Full hoặc Max.Cup
13=(G hoặc E) Full và Max.Cup
14=G hoặc E Full hoặc Max.Cup
15=Gold và Elixir Full
16=Gold hoặc Elixir Full
17=Gold Full và Max.Cup
18=Elixir Full và Max.Cup
19=Gold Full hoặc Max.Cup
20=Elixir Full hoặc Max.Cup
21=Gold Full
22=Elixir Full
23=Đạt Max. Cup
24=Dark Elixir Full
25=Tất cả Kho (G+E+DE) Full
26=Bot chạy cho...
27=Bây giờ (Chỉ Train/Donate)
28=Bây giờ (Chỉ Donate)
29=Bây giờ (Chỉ có ở lại trực tuyến)
30=W/Shield (Chỉ Train/Donate)
31=W/Shield (Chỉ Donate)
32=W/Shield (Chỉ có ở lại trực tuyến)
35=Bot sẽ tự động ngừng khi bạn chạy ra khỏi các nguồn lực. Nó sẽ tiếp tục khi đạt được những giá trị tối thiểu.
36=Resume Attack
37=Giá trị Gold tối thiểu cho các bot để tiếp tục tấn công sau khi ngừng vì gold thấp.
38=Giá trị Elixir tối thiểu cho các bot để tiếp tục tấn công sau khi ngừng vì elixir thấp.
39=Giá trị Dark Elixir tối thiểu cho các bot để tiếp tục tấn công sau khi ngừng vì dark elixir thấp.
40=Rearm, Collect, Clear
41=Rearm Traps && Reload Xbows và Infernos
42=Kiểm tra này để tự động Rearm Traps, Reload Xbows và Infernos (nếu có) trong Làng của bạn.
43=Collect Resources && Loot Cart
44=Kiểm tra này để tự động thu thập Tài Nguyên của Làng
45=từ Gold Mines, Elixir Collectors và Dark Elixir Drills.
46=Điều này cũng sẽ tìm kiếm 1 Loot Cart trong Làng của bạn và thu thập nó.
47=Dọn Tombstones
48=Kiểm tra này để tự động dọn tombstones sau khi kẻ thù tấn công.
49=Dọn Cây Cối
50=Kiểm tra này để tự động dọn Cây, Thân cây, vv
51=Dọn GemBox
52=Kiểm tra này để tự động dọn GemBox.
53=Xác Định Vị Trí Thủ Công
54=Townhall
55=Chuyển vị trí của bạn
56=Clan Castle
57=A.C.
58=Army Camp
59=Bar.
60=Barrack
61=S.F.
62=Spell Factory
63=D.S.F.
64=Dark Spell Factory
65=King
66=Barbarian King Altar
67=Queen
68=Archer Queen Altar
69=Grand Warden
70=Grand Warden Altar
71=Lab.
72=Laboratory
73=Thiết lập lại.
74=Nhấn vào đây để thiết lập lại tất cả các vị trí công trình,
75=khi bạn đã thay đổi cách bố trí ngôi làng của bạn.

[611]
611=***Section use for Tab Request Troops***
1=Quân Clan Castle
2=Request Quân / Spells
3=Anything please
4=Văn bản này được sử dụng để request quân cho bạn trong các cuộc trò chuyện Clan.
5=Lịch Donate

[612]
612=***Section use for Tab Donate Troops***
22=MEnu Lựa Chọn Donate Quân
23=Danh Sách Đen
24=Custom Troops
25=Cyrillic
26=Kiểm tra này để kích hoạt Cyrillic Alphabet.
27=Donate
28=Kiểm tra này để donate
29=Donate cho Tất cả
31=Điều này cũng sẽ bỏ qua tất cả các từ khóa.
32=Từ khóa cho donating
33=Không donate cho các từ khóa này
34=Danh sách đen cho donating
35=barbarians\r\nbarb
36=no barbarians\r\nno barb\r\nbarbarians no\r\nbarb no
37=archers\r\narch
38=no archers\r\nno arch\r\narchers no\r\narch no
39=giants\r\ngiant\r\nany\r\nreinforcement
40=no giants\r\ngiants no
41=goblins\r\ngoblin
42=no goblins\r\ngoblins no
43=wall breakers\r\nbreaker
44=no wall breakers\r\nwall breakers no
45=balloons\r\nballoon
46=no balloon\r\nballoons no
47=wizards\r\nwizard\r\nwiz
48=no wizards\r\nwizards no\r\nno wizard\r\nwizard no
49=healer
50=no healer\r\nhealer no
51=dragon
52=no dragon\r\ndragon no
53=PEKKA\r\npekka
54=no PEKKA\r\npekka no
55=minions\r\nminion
56=no minions\r\nminions no\r\nno minion\r\nminion no
57=hogriders\r\nhogs\r\nhog
58=no hogs\r\nhog no
59=valkyries\r\nvalkyrie\r\nvalk
60=no valkyries\r\nvalkyries no\r\nno valk\r\nvalk no
61=golem
62=no golem\r\ngolem no
63=witches\r\nwitch
64=no witches\r\nwitch no
65=lavahound\r\nlava\r\nhound
66=no lavahound\r\nlava no\r\nhound no
71=ground support\r\nground
72=1st
73=2nd
74=3rd
75=
76=no ground\r\nground no\r\nonly
77=KHÔNG donate cho bất kỳ của các từ khóa
78=Tổng Danh Sách Đen
79=clan war\r\nwar\r\ncw
80=Danh Sách Đen chung cho các donation requests
81=nếu từ khóa phù hợp với Request trong trò chuyện.
82=cho tất cả các Request trong Trò Chuyện.
83=
84=
85=
86=
87=poison
88=no poison\r\npoison no
89=earthquake\r\nquake
90=no earthquake\r\nquake no
91=haste
92=no haste\r\nhaste no
93=bowler\r\nbowlers\r\nbowl
94=no bowler\r\nbowl no
95=baby dragon\r\nbaby
96=no baby dragon\r\nbaby dragon no\r\nno baby\r\nbaby no
97=miner|mine
98=no miner\r\nminer no\r\nno mine\r\nmine no
99=skeleton|skel
100=no skeleton\r\nskeleton no\r\nno skel
101=air support\r\nany air
102=no air\r\nair no\r\nonly\r\njust
103=Chinese
104=Kiểm tra này để kích hoạt Chinese Alphabet.
105=lightning
106=no lightning\r\nlightning no
107=heal
108=no heal\r\nheal no
109=rage
110=no rage\r\nrage no
111=jump
112=no jump\r\njump no
113=freeze
114=no freeze\r\nfreeze no
115=Extra Alphabet Recognitions:
116=Korean
117=Kiểm tra này để kích hoạt Korean Alphabet.
1=Lưu ý: Donate bị vô hiệu hóa, đánh dấu vào dấu kiểm trên

[613]
613=***Section use for Tab Schedule Donations***
1=Lịch Donate
2=Lọc Donation Clan Mates
4=Không Lọc, donate cho tất cả Clan Mates
5=Không Lọc nhưng thu Hình Ảnh Clan Mates
6=Chỉ Donate cho Clan Mates trong Danh sách Trắng
7=Donate cho tất cả Clan Mates Ngoại trừ trong Danh sách Đen
8=Sử dụng tùy chọn này, bạn có thể chọn để donate cho tất cả các thành viên trong nhóm của bạn (Không Lọc), chỉ donate cho bạn bè nhất định (List Trắng) or cung cấp cho tất cả, ngoại trừ 1 vài thành viên trong nhóm của bạn (List Đen)
9=Mở Thư Mục Hình Ảnh Clan Mates
10=Hình ảnh của Clan Mates bị bắt và được lưu trữ trong thư mục chính, di chuyển đến thư mục phù hợp (List Trắng hoặc Đen)
13=Bỏ donation khi quân gần full
14=nếu các trại lính quân đội lớn hơn
15=Bỏ donation khi quân gần full

[614]
614=***Section use for Tab Upgrade Laboratory***
1=Laboratory
2=Tự Động Nâng Cấp Laboratory
3=Kiểm tra để cho phép tự động nâng cấp trong laboratory
4=Tiếp theo
5=Chọn kiểu quân nâng cấp với trình đơn kéo xuống này
6=Các biểu tượng quân sẽ xuất hiện ở bên phải.
7=Bất kỳ Dark Spell/Troop được ưu tiên hơn Nâng cấp Heroes!
8=Nút đỏ có thể nhìn thấy có nghĩa là trong quá trình nâng cấp laboratory
9=Điều này sẽ tự động biến mất khi gần thời gian để nâng cấp được hoàn thành.
10=Nếu nâng cấp đã được hoàn thành bằng tay với gems trước khi kết thúc thời gian bình thường,
11=Nhấn vào nút màu đỏ để thiết lập lại bộ đếm thời gian nâng cấp TRƯỚC KHI KHỞI ĐỘNG MỚI NÂNG CẤP
12=Chú ý - Không cần thiết hẹn giờ lặp lại sẽ buộc kiểm tra liên tục cho tình trạng phòng thí nghiệm
13=Bạn có chắc chắn 100% bạn muốn thiết lập lại hẹn giờ nâng cấp laboratory?
14=Nhấn OK để thiết lập lại
15=Hay nhấn Cancel để thoát
16=Thiết lập lại bộ đếm thời gian
17=Hủy bỏ và Trở về
18=Đặt lại hẹn giờ nâng cấp phòng thí nghiệm?
19=Nâng cấp Quân bắt đầu
20=Sẽ bắt đầu kiểm tra hoàn thành tại:

[615]
615=***Section use for Tab Upgrade Heroes***
1=Nâng Cấp Heroes Liên Tục
2=Tự động nâng cấp Heroes của bạn
3=Kích hoạt tính năng nâng cấp King của bạn khi bạn có đủ Dark Elixir (Tiết kiệm Min. Dark Elixir)
4=Bạn có thể tự xác định vị trí Kings Altar trên Tab Linh tinh
5=Xác minh tiếp tục Bot giá trị Dark Elixir tại Tab Linh tinh và Tiết kiệm Min. Dark Elixir tại đây!
6=Kích hoạt tính năng nâng cấp Queen của bạn khi bạn có đủ Dark Elixir (Tiết kiệm Min. Dark Elixir)
7=Bạn có thể tự xác định vị trí Queens Altar tại Tab Linh linh
8=Kích hoạt tính năng nâng cấp Warden của bạn khi bạn có đủ Elixir (Tiết kiệm Min. Elixir)
9=Bạn có thể tự xác định vị trí Wardens Altar tại Tab Linh tinh
11=Kích hoạt với TownHall 7 trở lên
12=Kích hoạt với TownHall 9 trở lên
13=Kích hoạt với TownHall 11

[616]
616=***Section use for Tab Upgrade Buildings***
1=Công Trình hoặc Heroes
2=Đơn Vị Tên
3=Lvl
4=Kiểu
5=Chi Phí
6=Time
7=Rep.
8=Vị Trí Nâng Cấp
9=Nút để xác định vị trí và thông tin hồ sơ về Nâng cấp Công trình/Heroes
10=Bất kỳ nâng cấp với lặp lại kích hoạt được bỏ qua và không thể được đặt lại
11=Thiết Lập Lại Nâng Cấp
12=Nhấn nút để thiết lập lại & loại bỏ thông tin nâng cấp
13=Nếu hộp lặp lại được kiểm tra, dữ liệu sẽ không được thiết lập lại
14=Min. Gold
15=Tiết kiệm lượng Gold này sau khi nâng cấp hoàn thành.
16=Đặt giá trị này khi cần thiết để tiết kiệm cho việc tìm kiếm, hoặc nâng cấp tường.
17=Min. Elixir
18=Tiết kiệm lượng Elixir này sau khi nâng cấp hoàn thành
19=Đặt giá trị này khi cần thiết để tiết kiệm cho việc quân đội hoặc nâng cấp tường.
20=Min. Dark
21=Tiết kiệm lượng Dark Elixir này sau khi nâng cấp hoàn thành.
22=Đặt giá trị này cao hơn nếu bạn muốn làm cho quân War.
27=Kiểm hộp này để Kích Hoạt Nâng Cấp
28=sau khi sử dụng Xác định vị trí nút Nâng cấp
29=Điều này cho thấy loại nâng cấp, bấm vào để hiển thị vị trí
30=Trạng thái: Đỏ=không được lập trình, Vàng=lập trình, chưa hoàn thành, Xanh=Đã hoàn thành
31=Hộp này được cập nhật với tên đơn vị sau khi nâng cấp đều được kiểm tra
32=Hộp đơn vị này được cập nhật với các cấp độ đơn vị sau khi nâng cấp đều được kiểm tra
33=Hộp chi phí nâng cấp này được cập nhật sau khi nâng cấp đều được kiểm tra
34=Hộp này được cập nhật với thời gian dài nâng cấp sau khi nâng cấp đều được kiểm tra
35=Hộp kiểm này để Kích hoạt Nâng cấp tiếp tục lặp lại
36=Hộp này được cập nhật theo thời gian ước tính cuối nâng cấp sau khi nâng cấp đều được kiểm tra
37=Ước Tính End

[617]
617=***Section use for Tab Upgrade Wall***
1=Walls
2=Tự Động Nâng Cấp Wall
3=Kiểm tra này để nâng cấp Walls nếu có đủ các nguồn lực.
4=Số vị trí để kiểm tra và tìm thấy walls. Cao hơn là tốt hơn nhưng chậm hơn.
5=TEST
6=Nhấn vào đây để kiểm tra Phát hiện Wall.
7=Dùng Gold
8=Chỉ sử dụng Gold cho Walls.
9=Có sẵn ở tất cả các cấp độ Wall.
10=Dùng Elixir
11=Chỉ dùng Elixir cho Walls.
12=Chỉ ở mức cấp độ Wall nâng cấp với Elixir.
13=Hãy thử Elixir đầu tiên, Gold thứ hai
14=Hãy thử sử dụng Elixir đầu tiên. Nếu không đủ Elixir cố gắng sử dụng Gold thứ hai cho Walls.
15=Tiết kiệm 1 builder cho Walls
16=Kiểm tra này để dành tối thiểu 1 builder riêng cho walls và
17=giảm builder sẵn của 1 cho nâng cấp khác
18=Tìm kiếm mức Walls
19=Tìm kiếm Walls của cấp độ này và cố gắng nâng cấp từng cái một.
20=Phí lvl Wall Tiếp theo
21=Sử dụng giá trị này như là một chỉ số.
22=Giá trị sẽ cập nhật nếu bạn chọn một mức độ wall khác.
23=Min. Gold để save
24=Tiết kiệm được nhiều Gold này sau khi nâng cấp wall hoàn thành,
25=Đặt giá trị này để tiết kiệm Gold để nâng cấp khác, hoặc tìm kiếm.
27=Tiết kiệm nhiều Elixir này sau khi nâng cấp wall hoàn thành,
28=Đặt giá trị này để tiết kiệm Elixir cho nâng cấp khác hoặc làm quân.
29=Bộ đếm Walls
30=Số đầu vào của mức Walls
31=bạn có.
32=Min. Elixir để save

[618]
618=***Section use for Tab Achievements***
1=Phòng Thủ Nông Nghiệp
2=Bật Không Thể Phá Vỡ
3=Kích hoạt Phòng thủ Nông nghiệp cho tính năng Không thể phá vỡ.
4=Thời gian chờ
5=Đặt số lượng thời gian để dừng lại CoC và chờ cho các cuộc tấn công của đối phương để giành chiến thắng phòng thủ. (1-99 phút)
6=Phút
7=Farm Min.
8=Save Min.
9=Lượng Gold để dừng Phòng thủ Nông nghiệp, chuyển sang canh tác bình thường nếu dưới.
10=Đặt giá trị số Gold này bạn cần để tìm kiếm hoặc nâng cấp.
11=Lượng Gold trong yêu cầu lưu trữ để Bật Phòng thủ Nông nghiệp.
12=Lượng Gold của bạn cần để thu hút đối phương hoặc để nâng cấp.
13=Lượng Elixir để dừng Phòng thủ Nông nghiệp, chuyển sang canh tác bình thường nếu dưới.
14=Đặt giá trị số Elixir bạn cần để làm cho quân đội hoặc nâng cấp.
15=Lượng Elixir trong yêu cầu lưu trữ để Bật Phòng thủ Nông nghiệp.
16=Lượng Elixir của bạn cần để thu hút đối phương hoặc để nâng cấp.
17=Lượng Dark Elixir để dừng Phòng thủ Nông nghiệp, chuyển sang canh tác bình thường nếu dưới.
18=Đặt giá trị số Dark Elixir bạn cần để làm cho quân đội hoặc nâng cấp.
19=Lượng Dark Elixir trong yêu cầu lưu trữ để Bật Phòng thủ Nông nghiệp.
20=Lượng Dark Elixir của bạn cần để thu hút đối phương hoặc để nâng cấp.
21=Làm thế nào để sử dụng chế độ Không thể phá vỡ
22=Chế độ Không thể phá vỡ sẽ giúp bạn có được trận thắng phòng thủ và các thành tích "Không thể phá vỡ".
23=Đặt "Thời gian Chờ" để bao lâu bạn muốn bot để chờ phòng thủ.
24=Farm Min là bao nhiêu tài nguyên bot phải có trước khi tấn công.
25=Save Min là bao nhiêu tài nguyên bot phải có trước khi bắt đầu chế độ không thể phá vỡ.
26=Nhấp vào liên kết dưới đây để biết thêm thông tin:
27=Thêm thông tin

[619]
619=***Section use for Tab Notify PushBullet***
1=Thông Báo PushBullet/Telegram
2=Bật PushBullet
3=Kích Hoạt thông báo PushBullet
4=Bật Telegram
5=Kích Hoạt thông báo Telegram
6=Điều khiển từ xa
7=Cho phép chức năng PushBullet điều khiển từ xa
8=Xóa Tin nhắn khi Start
9=Nó sẽ xóa tất cả các thông báo trước khi bạn bắt đầu bot
10=Delete all Msg now
11=Nhấn vào đây để xóa tất cả tin nhắn Pushbullet.
12=Xóa tin nhắn cũ hơn
13=Xóa tất cả các thông báo trước đó lớn hơn giờ quy định
14=Thiết lập khoảng thời gian cho các tin nhắn được xóa.
15=Giờ
16=Mã (PushBullet)
17=Bạn cần một Mã để sử dụng thông báo PushBullet. Nhận một mã từ PushBullet.com
18=Mã (Telegram)
19=Bạn cần một Mã để sử dụng thông báo Telegram. Nhận một mã từ Telegram.com
20=Origin
21=Origin - Village name.
22=Gửi tin nhắn PushBullet/Telegram cho các tùy chọn này
23=Match Found
24=Gửi lượng tài nguyên có sẵn khi bot tìm thấy một ngôi làng để tấn công.
25=Last raid as image
26=Gửi ảnh chụp màn hình khi kết thúc trận đấu.
27=Last raid as Text
28=Gửi kết quả kết thúc trận đấu dưới dạng văn bản.
29=Trại Quân Đầy
30=Gửi một cảnh báo khi trại quân đội của bạn là đầy đủ.
31=Wall upgrade
32=Gửi thông tin về nâng cấp tường.
33=Lỗi: Out Of Sync
34=Gửi một cảnh báo khi bạn nhận được Lỗi: Client and Server out of sync
35=Take a break
36=Gửi một cảnh báo khi bạn đã được chơi quá lâu và dân làng của bạn cần nghỉ ngơi.
37=Builder Rảnh
38=Gửi một cảnh báo khi có ít nhất một builder là nhàn rỗi.
39=Báo cáo Làng
40=Gửi Thống kê Làng.
41=Alert Last Attack
42=Gửi thông tin về tấn công cuối.
43=Thiết bị khác
44=Gửi một cảnh báo khi ngôi làng của bạn được kết nối với một thiết bị khác.
45=Bảo Trì
46=Gửi một cảnh báo khi CoC được bảo trì bởi SuperCell
47=BAN
48=Gửi một cảnh báo nếu ngôi làng của bạn đã được CẤM bởi SuperCell
49=BOT Update
50=Gửi một cảnh báo khi có một phiên bản mới của bot.
51=Lịch Thông báo
52=Chỉ trong những giờ trong ngày
53=Nút này sẽ dọn dẹp, hoặc thiết lập toàn bộ hàng của hộp
54=Chỉ thông báo trong ngày này trong tuần
55=S
56=Sunday
57=M
58=Monday
59=T
60=Tuesday
61=W
62=Wednesday
63=T
64=Thursday
65=F
66=Friday
67=S
68=Saturday
69=Trợ giúp ?
70=Nhấn vào đây để tải về Trợ giúp Thông báo cho các lệnh từ xa PushBullet và Telegram

[620]
620=***Section use for Notify Revamp***
1=BOT
2=Trợ giúp
3= - Bạn từ xa có thể gửi LỆNH kiểm soát bot của bạn từ danh sách sau:
4=HELP
5= - gửi thông báo trợ giúp này
7=DELETE
8= - xóa tất cả tin nhắn PushBullet trước đó của bạn
9=RESTART
10= - khởi động lại Giả lập và bot tên
11=STOP
12= - dừng bot tên
13=PAUSE
14= - tạm dừng bot tên
15=RESUME
16= - tiếp tục bot tên
17=STATS
18= - gửi thống kê Làng của
19=LOG
20= - gửi các tập tin bản ghi hiện tại của
21=LASTRAID
22= - gửi các ảnh chụp loot cuộc tấn công cuối cùng của
23=LASTRAIDTXT
24= - gửi các giá trị loot tấn công cuối cùng của
25=SCREENSHOT
26= - gửi một ảnh chụp của
27=SCREENSHOTHD
28= - gửi một ảnh chụp ở độ phân giải cao của
29=BUILDER
30= - gửi một ảnh chụp của tình trạng builder của
31=SHIELD
32= - gửi một ảnh chụp của tình trạng shield
33=RESETSTATS
34= - reset Thống kê Làng
35=TROOPS
36=E
37=HALTATTACKON
38=Attack Off
39= - Bật 'Dừng Tấn Công' trong Tab 'Linh Tinh' với tùy chọn 'ở lại trực tuyến'
40=HALTATTACKOFF
41=Attack On
42= - Tắt 'Dừng Tấn Công' trong Tab 'Linh Tinh'
43=HIBERNATE
44= - Hibernate host PC
45=PC Hibernate sequence initiated
46=SHUTDOWN
47=Shut down
48= - Shut down host PC
49=PC Shutdown sequence initiated
50=STANDBY
51= - Standby host PC
52=PC Standby sequence initiated
59=S
97=Lệnh không được công nhận
98=Các ví dụ:
99=Vui lòng ấn BOT HELP để có được một danh sách lệnh hoàn chỉnh.
100=Yêu cầu trợ giúp
101=logs
102=Nhật ký Hiện tại
103=Tìm thấy Trận đấu! sau
104=skip(s)
105=Số. của Builders Frees
106=Chief, chúng tôi cần một số phần còn lại!!
107=Làng phải mất một break..
108=Báo cáo Số liệu Thống Kê Làng
109=G
110=E
111=DE
112=T
113=S
114=Bây giờ (Tài nguyên hiện tại)
115=Bỏ qua
116=Tấn công
117=Số của Up Wall
118=Đột kích Cuối
119=Đột kích Cuối txt
120=Loots
121=GEM
122=Bạn có
123=builder(s) rảnh.
124=Yêu cầu để Stop
125=Yêu cầu để Stop...
126=Bot của bạn bây giờ là dừng...
127=Bot của bạn hiện tại đang dừng, không có hành động được thực hiện
128=Army Camps của bạn bây giờ là đầy đủ
129=Chief, có một phiên bản mới của bot có sẵn
130=Bot của bạn hiện đang được tiếp tục, không có hành động được thực hiện
131=Không có cuộc đột kích chụp màn hình mới
132=Bot và Giả lập của bạn bây giờ khởi động lại
133=Bot của bạn bây giờ là dừng
134=Bot của bạn hiện tại đang dừng, không có hành động được thực hiện
135=Thống kê tự đặt lại.
136=Troops/Spells set to Train
137=Chief, bạn yêu cầu cho Thông tin Builder sẽ được xử lý càng sớm càng tốt
138=Không thể tạm dừng trong cuộc tấn công, hãy thử lại sau.
139=Chief, bạn yêu cầu cho Thông tin Shield sẽ được xử lý càng sớm càng tốt
140=Thu được mỗi Giờ
141=Không có cuộc đột kích chụp màn hình mới.
142=Đột kích Cuối txt
143=Bot và Giả lập của bạn bây giờ khởi động lại...
144=tập tin tải lên máy chủ PushBullet
145=Bot khởi động lại
146=Xảy ra một lỗi 2 loại tập tin tải lên máy chủ Telegram...
147=Chief, bạn yêu cầu cho Chụp màn hình sẽ được xử lý càng sớm càng tốt
148=Tại Bắt đầu
149=Tấn công tại
150=Bot của bạn hiện đang dừng, không có hành động được thực hiện
151=Bot của bạn hiện đang được tiếp tục, không có hành động được thực hiện
152=Đột kích Cuối
153=Nâng cấp
154=Bỏ qua nâng cấp
155=CoC Có Lỗi Stopped
156=Yêu cầu của bạn đã được nhận. Bot hiện bị tạm dừng
157=Yêu cầu của bạn đã được nhận. Bot hiện được tiếp tục
158=Không thể xác định vị trí nút Next, Khởi động lại Bot
159=Hoàn thành sử dụng bằng GOLD
160=Không thể tìm thấy nút nâng cấp gold
161=Không thể tìm thấy nút nâng cấp elixir
162=Ảnh chụp màn hình ngôi làng của bạn
164=Không thể tạm dừng trong cuộc tấn công, hãy thử lại sau.
165=Yêu cầu Khởi động lại
166=Yêu cầu Tạm dừng
167=Yêu cầu Tiếp tục
168=Đào tạo Troops & Spells Hiện tại
169=Army Camp Hiện tại
170=Không thể Upload File
171=Xảy ra một loại lỗi
172=Khởi động lại sau khi lỗi Out of Sync
173=level Wall tìm thấy
174=Không thể tìm thấy level Wall
175=Thiết bị khác kết nối
176=Thiết bị khác đã được kết nối, chờ đợi
177=Đoạn Wall đã được xác định
178=Ngắt kết nối sau
179=Nâng cấp hoàn thành bằng sử dụng GOLD
180=Nâng cấp hoàn thành bằng sử dụng ELIXIR
181=Không nâng cấp nút Elixir
700=Thông báo PushBullet
701=Thông báo Telegram
702=Yêu cầu của bạn đã nhận được từ
703=Trợ giúp đã được gửi đi
704=Yêu cầu của bạn đã được nhận.
705=Yêu cầu của bạn đã được nhận. Bot và Giả lập Android khởi động lại...
706=Yêu cầu của bạn đã được nhận. Bot hiện đang dừng lại
707=Không thể tạm dừng trong cuộc tấn công
708=Bot của bạn hiện đang bị tạm dừng, không có hành động được thực hiện
709=Bot của bạn hiện đang được tiếp tục, không có hành động được thực hiện
710=Yêu cầu của bạn đã được nhận. gửi Thống kê
712=Nhật ký đã được gửi
711=Yêu cầu của bạn đã nhận được từ
713=Push Last Raid Snapshot...
714=Yêu cầu của bạn đã được nhận. gửi Last Raid txt
715=Yêu cầu Ảnh chụp màn hình đã nhận được
716=Yêu cầu Ảnh chụp màn hình HD đã nhận được
717=Yêu cầu Tình Trạng Builder đã nhận được
718=Yêu cầu Tình Trạng Shield đã nhận được
719=Yêu cầu của bạn đã được nhận. Thống kê tự đặt lại
720=Yêu cầu của bạn đã được nhận. Gửi Thông kê Troop/Spell...
721=Hibernate PC
722=Shutdown PC
723=Standby PC
724=nhận được cú pháp lệnh sai, lệnh bỏ qua.
725=Thông báo không lên kế hoạch cho giờ này! Thông báo bỏ qua
726=Không thể gửi tập tin
727=Last Raid Text đã được gửi đi!
728=Last Raid screenshot đã được gửi đi!
729=Xảy ra lỗi khi xóa tập tin ảnh chụp màn hình tạm thời.
730=Gửi Screenshot!
731=Gửi Thông tin Builder!
732=Gửi Thông tin Shield!
733=Tất cả các tin nhắn đã xóa.
734=loại bỏ
735=tin nhắn cũ hơn
801=Screenshot
802=Builder
803=Shield
804=Stats
805=Troops
806=Help
807=Stop
808=Pause
809=Resume
810=Restart
811=Log
812=Lastraid
813=LastRaidTxt
814=Attack On
815=Attack Off
816=Hibernate
817=Shut down
818=Standby

[621]
621=***Section use for Tab Troops***
1=Lính Elixir
2=Thiết lập các loại thành phần Quân đội.
3='Sử dụng Chế độ Barrack' hoặc 'Tạo lính Tùy chỉnh' cho những tác phẩm bằng tay.
4=Chỉ dùng: Archers
5=Chỉ dùng: Barbarians
6=Chỉ dùng: Goblins
7=Chỉ dùng: B.Arch
8=Chỉ dùng: B.A.G.G.
9=Chỉ dùng: B.A.Giant
10=Chỉ dùng: B.A.Goblin
11=Chỉ dùng: B.A.G.G.Wall
12=Sử dụng Chế độ Barrack
13=Tạo lính Tùy chỉnh
14=Lính
15=Tổng
16=Tổng số các đơn vị của Quân đội phải bằng Tổng số Quân Trại.
17=Chế độ Barrack
18=Đặt quân thực hiện trong Barrack
19=Army Strength
20='Đầy' Trại
21=Trại lính được 'Đầy' khi đạt % này, sau đó bắt đầu tấn công.
22=Thêm Lính
23=Lính Dark Elixir
24=Thêm Lính Dark
25=Lính Dark Barracks
26=Nhập Số
27= để làm.
28=Nhập Số
29=Spells để làm.
30=Toàn bộ không gian trống
31=Hoàn thành với archers
32=Nếu xxxx xxx xxxxx (chèn một mô tả tốt) xxxx xxxx
33=Quick Train
34=Dùng Quick Train
35=Sử dụng chức năng Quick Train để đào tạo trước quân hoặc Army 1, 2 or 3 được xác định trước
36=Trước
37=Army 1
38=Army 2
39=Army 3
40=Chuột Trái Click để Tăng level\r\nShift + Chuột Trái Click để Giảm level
41=Xóa Army
42=Buộc Nấu Spells
200=Đào tạo thời gian nhàn rỗi
201=Đóng Trong khi Đào tạo
202=Tùy chọn này sẽ đóng ứng dụng CoC cho thời gian cần thiết để hoàn thành huấn luyện quân
203=Spell Creation
204=Tùy chọn này sẽ đóng CoC cho thời gian đào tạo cần thiết để hoàn thành Spell
205=Hero Healing
206=Tùy chọn này sẽ đóng CoC cho thời gian đào tạo cần thiết cho Hero sông lại, Đòi hỏi phải chờ đợi cho Heroes được kích hoạt!
207=Đóng Giả lập
208=Tùy chọn này sẽ đóng Giả lập Android, trong khi chờ đợi cho quân đội để đào tạo!
209=Thời gian chuẩn
210=Chọn để chờ đợi thời gian chính xác cần thiết cho quân đội để hoàn thành đào tạo
211=Thêm Ngẫu nhiên Time
212=Chọn để thêm một thời gian chờ đợi ngẫu nhiên như con người quên đụng độ
213=Nhập tỷ lệ phần trăm tối đa thêm thời gian để được sử dụng tạo ra thời gian chờ ngẫu nhiên,
214=Bot sẽ tính toán một thời gian chờ đợi ngẫu nhiên giữa thời gian chính xác cần thiết, và
215=thời gian chính xác cộng với phần trăm ngẫu nhiên xuất hiện nhiều hơn con người
220=Chọn bao nhiêu thời gian để chờ đợi khi tính năng cho phép

[622]
622=***Section use for Tab Spells***
1=Thành phần Spells
2=Sức chứa Spell
3=Nhập số của sức chứa Spells. Đặt ZERO nếu bạn không muốn bất kỳ Spells

[623]
623=***Section use for Tab Boost***
1=Boosts left
2=Boost Barracks
3=Số lượng Barracks để Boost
4=Làm thế nào nhiều Barracks để boost với GEMS? Sử dụng thận trọng!
5=Barracks
6=Sử dụng điều này để boots Barracks của bạn với GEMS! Sử dụng thận trọng!
7=Boost Spell Factories
8=Spell Factory
9=Sử dụng điều này để boost Spell Factory của bạn với GEMS! Sử dụng thận trọng!
10=Dark Spell Factory
11=Sử dụng điều này để boost Dark Spell Factory của bạn với GEMS! Sử dụng thận trọng!
12=Boost Heroes
13=Barbarian King
14=Sử dụng điều này để boost Barbarian King của bạn với GEMS! Sử dụng thận trọng!
15=Archer Queen
16=Sử dụng điều này để boost Archer Queen của bạn với GEMS! Sử dụng thận trọng!
17=Grand Warden
18=Sử dụng điều này để boost Grand Warden của bạn với GEMS! Sử dụng thận trọng!
19=Lịch Boost

[624]
624=***Section use for Tab Attack***
1=Tấn Công với
2=Kiểu Tấn Công
3=Tấn Công Chuẩn
4=Tấn Công Scripted
5=Tấn Công Milking
6=Chỉ thả những quân
7=Sử dụng tất cả quân
8=Sử dụng quân (.) Barracks
9=Chỉ Barb
10=Chỉ Arch
11=B+A
12=B+Gob
13=A+Gob
14=B+A+Gi
15=B+A+Gob+Gi
16=B+A+Hog Rider
17=B+A+Minion
18=Chọn các quân để sử dụng trong các cuộc tấn công
19=Quân đặc biệt để sử dụng
20=Sử dụng King của bạn khi Tấn công...
21=Sử dụng Queen của bạn khi Tấn công...
22=Sử dụng Warden của bạn khi Tấn công...
23=Thả Clan Castle của bạn trong trận chiến nếu nó có chứa quân.
24=Sử dụng Light Spells của bạn khi Tấn công...
25=Sử dụng Healing Spells của bạn khi Tấn công...
26=Sử dụng Rage Spells của bạn khi Tấn công...
27=Sử dụng Jump Spells của bạn khi Tấn công...
28=Sử dụng Freeze Spells của bạn khi Tấn công...
29=Sử dụng Poison Spells của bạn khi Tấn công...
30=Sử dụng Earthquake Spells của bạn khi Tấn công...
31=Sử dụng Haste Spells của bạn khi Tấn công...
32=TH Snipe
33=Snipe TH External first
34=Nếu TH là bên ngoài bắt đầu với một TH Snipe
35=Thêm gạch
36=Số tối đa của gạch từ biên giới đến xem xét TH như bên ngoài
37=Bạn có thể thêm/chỉnh sửa thiết lập CSV trong thư mục CSV\THSnipe
38=Tấn công Townhall Ngoài
39=Kiểm tra này để tấn công một Towhall tiếp xúc đầu tiên. (Townhall bên ngoài của Tường)
40=TIP: Cũng đánh dấu 'Gặp Townhall Bên ngoài' trên tab Tìm kiếm nếu bạn chỉ muốn tìm kiếm các căn cứ với Townhalls tiếp xúc.
41=Bật với TownHall 7 trở lên
42=Bật với TownHall 9 trở lên
43=Bật với Townhall 11
44=Sử dụng Clone Spells của bạn khi Tấn công...
45=Sử dụng Skeletons Spells của bạn khi Tấn công...

[625]
625=***Section use for Tab Search***
0=Bắt Đầu Tìm Kiếm NẾU
1=Tìm Kiếm
2=Đặt Min. số lượng tìm kiếm để kích hoạt tùy chọn tấn công này
3=Thiết lập số lượng tối đa các tìm kiếm để kích hoạt tùy chọn tấn công này
4=Cup
5=Đặt Min. số Cup mà cuộc tấn công này sẽ được sử dụng
6=Thiết lập số lượng tối đa của chiếc cúp mà cuộc tấn công này sẽ được sử dụng
7=Trại Lính
8=Thiết lập các % trại lính cần thiết để kích hoạt tùy chọn tấn công này trong khi tìm kiếm
9=Chờ đợi cho Heroes là Sẵn sàng
10=Chờ cho King để sẵn sàng trước khi tấn công...
12=Chờ cho Queen để sẵn sàng trước khi tấn công...
13=Chờ cho Warden để sẵn sàng trước khi tấn công...
14=Bộ Lọc
15=Tìm kiếm một base đáp ứng các giá trị thiết lập cho Gold Và/Hoặc/Thêm Elixir.
16=Và: Cả hai điều kiện phải đáp ứng, Gold và Elixir.
17=Hoặc: Một điều kiện phải đáp ứng, Gold hoặc Elixir.
18=+ (THÊM): Tổng số tiền của Gold + Elixir phải đáp ứng.
19=G Và E
20=G Or E
21=G + E
23=Đặt số Gold tối thiểu để tìm kiếm một ngôi làng tấn công.
24=Đặt số Elixer tối thiểu để tìm kiếm một ngôi làng tấn công.
25=Đặt số Gold + Elixer tối thiểu để tìm kiếm một ngôi làng tấn công.
26=Dark Elixir
27=Tìm kiếm một base đáp ứng các giá trị thiết lập cho Min. Dark Elixir.
28=Đặt số Dark Elixir tối thiểu để tìm kiếm một ngôi làng tấn công.
29=Tìm kiếm một base đáp ứng các giá trị thiết lập cho Min. Cup.
30=Đặt số Cup tối thiểu để tìm kiếm một ngôi làng tấn công.
31=Townhall
32=Tìm kiếm một base đáp ứng các giá trị thiết lập cho Max. Townhall Level.
33=Đặt Max. cấp độ của Townhall để tìm kiếm trên một ngôi làng để tấn công.
34=Townhall bên ngoài
35=Tìm kiếm một base có một Townhall tiếp xúc. (Bên ngoài của Tường)
36=Base Yếu
37=Tìm kiếm một base có phòng thủ thấp.
38=Đặt Max. cấp độ của Mortar để tìm kiếm trên một ngôi làng để tấn công.
39=Đặt Max. cấp độ của Wizard Tower để tìm kiếm trên một ngôi làng để tấn công.
40=Thỏa 1 điều kiện là đánh
41=Chỉ cần đáp ứng chỉ MỘT trong các điều kiện trên, sau đó Tấn công.
42=TownHall, Khoảng cách Từ
43=Biên giới, Thêm gạch
44=Trong khi Train
45=Thêm số lượng gạch từ Base Edges
46=Đầy lính
47=Nhập bao nhiêu 'Cỏ' 1x1 gạch TH có thể từ các cạnh cơ sở để được nhìn thấy như là một TH ngoài.
48=Ví dụ: (0) gạch; TH phải được chính xác ở mép. (4) gạch: TH có thể 4 gạch xa hơn từ các cạnh và gần với trung tâm của làng.
49=Nếu TH là xa hơn thì số gạch được thiết lập, các base sẽ được bỏ qua.
50=Tùy chọn Chờ Hẻo vô hiệu hóa khi nâng cấp liên tục Hero được lựa chọn!
51=Đặt Max. Cấp độ của X-Bow để tìm kiếm trên một ngôi làng để tấn công.
52=Đặt Max. Cấp độ của Inferno Tower để tìm kiếm trên một ngôi làng để tấn công.
53=Đặt Max. Cấp độ của Eagle Artillery để tìm kiếm trên một ngôi làng để tấn công.
54=Max Mortar
55=Max Wizard
56=Max X-Bow
57=Max Inferno
58=Max Eagle
59=Tìm kiếm một base có Mortar dưới cấp độ này.
60=Tìm kiếm một base có Wizard Tower dưới cấp độ này
61=Tìm kiếm một base có X-Bow dưới cấp độ này
62=Tìm kiếm một base có Inferno dưới cấp độ này
63=Tìm kiếm một base có Eagle Artillery dưới cấp độ này
64=Tìm kiếm một base có Air Defense dưới cấp độ này
65=Bật với TownHall 7 trở lên
66=Bật với TownHall 9 trở lên
67=Bật với TownHall 11
68=Chú thích - cho phép phạm vi TÌM KIẾM CHỈ cho kiểu tấn công này.
69=Cài đặt sẽ không đặt giới hạn tìm kiếm để khởi động lại quá trình tìm kiếm!
70=Tùy chọn này sẽ không điều chỉnh Cup ở trong phạm vi bước!
71=Chờ đợi cho Spells là Sẵn sàng
72=Dừng tìm kiếm loại tấn công này khi Spells chưa sẵn sàng
73=Cảnh báo: Không cho phép, trừ khi bạn có spell factory hoặc bot sẽ không tấn công!
74=Chờ đợi để có Castle Spell
75=Chờ cho đến khi Người Donate cho bạn một Spell
76=Bất kì
77=Chờ cho đến khi ai đó Donate Spell này, Hay loại bỏ những spells trong Castle và Request Lại
78=Chờ đợi quân Castle được đầy đủ
79=Chờ đợi Castle Clan của bạn đầy đủ
80=Base Yếu | Max phòng thủ
81=Đặt Max. cấp độ của Air Defense để tìm kiếm trên một ngôi làng để tấn công.
110=Tổng số spell được đào tạo vượt quá tổng trong GUI!
111=Giảm số spells được đào tạo,
112=HOẶC CÁI GÌ KHÁC BOT SẼ KHÔNG BAO GIỜ ĐƯỢC TẤN CÔNG!!
113=Bấm YES để đóng thông điệp cảnh báo này
114=YES, tôi Hiểu Cảnh báo|No
115=Cảnh báo Chờ cho Spells!
116=Xin lỗi, phải hiểu được cảnh báo và nhấn Yes!
117=OK
118=User Input Error
119=XIN CHÚC MỪNG!!
120=Bạn tìm thấy thông điệp bí mật trong Bot!
121=Bạn có thể tìm thấy các nút lựa chọn ngẫu nhiên để đóng thông điệp này?
122=HaHaHaHa...
123=Bạn là một người chiến thắng!!
124=Xin lỗi không nút!
125=Đóng góp £5000 cho MyBot.run trong khi chờ đợi 15 phút cho việc này để thời gian ra?
126=Có khó khăn khi tìm nút thoát?
127=Đây là niềm vui, chúng ta có thể tiếp tục đi cả ngày?
128=Hãy thử thêm bốn lần, bạn có thể có được may mắn sớm hay muộn!
129=Bạn đã có một Trái chuối? Mã Khỉ này là Đói!
130=Có thể thử đánh cùng một nút cho đến khi bạn và Mr. Random chọn cùng?
131=Xin lỗi, không thể 'thoát' khỏi này!
132=Lỗi chương trình! Các lập trình viên có thể làm hỏng cả một trò đùa tốt.

[626]
626=***Section use for Tab Collectors***
1=Collectors
2=Chọn nhà sưu tập để tìm kiếm khi tìm kiếm một nhà hoang. Ngoài ra, chọn cách đầy đủ thì phải.
3=Lvl 6. Phải là >
4=Lvl 7. Phải là >
5=Lvl 8. Phải là >
6=Lvl 9. Phải là >
7=Lvl 10. Phải là >
8=Lvl 11. Phải là >
9=Lvl 12. Phải là >
10=(N/A)
11=Lòng khoan dung
12=Sử dụng thanh trượt này để điều chỉnh sai số của tất cả các hình ảnh.
13=Nếu bạn muốn điều chỉnh hình ảnh cá nhân, bạn phải chỉnh sửa các tập tin.
15=Nếu hộp này được chọn, sau đó bot sẽ xem xét
16=cho cấp 6 elixir collectors trong phát hiện nhà hoang.
17=cho cấp 7 elixir collectors trong phát hiện nhà hoang.
18=cho cấp 8 elixir collectors trong phát hiện nhà hoang.
19=cho cấp 9 elixir collectors trong phát hiện nhà hoang.
20=cho cấp 10 elixir collectors trong phát hiện nhà hoang.
21=cho cấp 11 elixir collectors trong phát hiện nhà hoang.
22=cho cấp 12 elixir collectors trong phát hiện nhà hoang.
23=Chọn cách đầy đủ mức 6 collector cần phải cho nó sẽ được đánh dấu "chết"
24=Chọn cách đầy đủ mức 7 collector cần phải cho nó sẽ được đánh dấu "chết"
25=Chọn cách đầy đủ mức 8 collector cần phải cho nó sẽ được đánh dấu "chết"
26=Chọn cách đầy đủ mức 9 collector cần phải cho nó sẽ được đánh dấu "chết"
27=Chọn cách đầy đủ mức 10 collector cần phải cho nó sẽ được đánh dấu "chết"
28=Chọn cách đầy đủ mức 11 collector cần phải cho nó sẽ được đánh dấu "chết"
29=Chọn cách đầy đủ mức 12 collector cần phải cho nó sẽ được đánh dấu "chết"
30=Đầy
31=CẢNH BÁO: Không thay đổi thiết lập này, trừ khi bạn biết những gì bạn đang làm. Đặt nó là 0 nếu bạn không chắc chắn.
32=Vô hiệu hoá Lọc Collector
33=Loại bỏ Bộ lọc Collector bot xem xét Nhà hoang như Nhà sống
34=Số Mỏ Cần Thiết
35=Chọn cách nhiều mỏ collector là cần thiết để xem xét ngôi làng "chết"
40=Kiểm tra Collectors bên ngoài
41=Tìm kiếm các cơ sở có collectors bên ngoài.
42=Đặt Min. % của collectors bên ngoài để tìm kiếm trên một ngôi làng để tấn công.

[627]
627=***Section use for Tab Load Strategy***
1=LOAD PRECONFIGURED SETTINGS.\n\n- Load ALL Train Army Tab Settings\n- Load ALL Search && Attack Tab Settings\n\n- EXCEPT: Share Replay Settings\n- EXCEPT: Take Loot Snapshot Settings\n- EXCEPT: Gem Boost Settings
2=Load Configuration
3=Delete
4=Open Strategy folder

[628]
628=***Section use for Tab Save Strategy***
1=Strategy file name
2=Notes
3=SAVE SETTINGS\n--------------------------------------\nSave ALL:\n- Train Army Tab Settings\n- Search && Attack Tab Settings\n\nExcept:\n- Share Replay Settings\n- Take Loot Snapshot Settings\n- Gem Boost Settings\n--------------------------------------
4=Save Configuration

[629]
629=***Section use for Tab Bully***
1=Bully Attack Combo
2=Chế độ Bully, TẤT CẢ bases đáp ứng các yêu cầu cấp TH bên dưới sẽ bị tấn công.
3=Kích hoạt Bully sau
4=TH Bully: Số tìm kiếm để chờ đợi trước khi kích hoạt.
6=Max cấp độ TH
7=TH Bully: Max. Cấp độ Townhall để bắt nạt.
8=Khi được tìm thấy, Tấn công với các thiết lập từ
9=Atk. Nhà Hoang
10=Sử dụng các thiết lập cuộc tấn công nhà hoang khi tấn công một trận đấu TH Bully.
11=Atk. Nhà Sống
12=Sử dụng các thiết lập cuộc tấn công nhà sống khi tấn công một trận đấu TH Bully.

[630]
630=***Section use for Tab Options Search***
1=Giảm Tìm Kiếm
2=Kích hoạt tính năng Giảm Tìm kiếm
3=Kiểm tra này nếu bạn muốn các giá trị tìm kiếm tự động được hạ xuống sau khi một số tiền nhất định của các tìm kiếm.
4=Giảm mục tiêu sau
5=Nhập số tìm kiếm để chờ đợi trước mỗi giảm xảy ra.
6=- Giảm Gold
7=Giảm Gold sau số lần tìm trong bước tiếp theo.
8=- Giảm Elixir
9=Giảm Elixir sau số lần tìm trong bước tiếp theo.
10=- Giảm Gold + Elixir
11=Giảm G+E sau số lần tìm trong bước tiếp theo.
12=- Giảm Dark Elixir
13=Giảm Dark Elixir sau số lần tìm trong bước tiếp theo.
14=- Giảm Cup
15=Giảm Cup sau số lần tìm trong bước tiếp theo.
16=Tùy chọn Tìm Kiếm
17=Tấn Công Ngay! tùy chọn.
18=Kiểm tra này nếu bạn muốn lựa chọn để có một 'Tấn công Ngay!' nút bên cạnh
19=Thêm
20=Thêm số thời gian phản ứng chậm lại việc tìm kiếm.
21=Khởi động lại mỗi
22=Quay trở lại Cơ sở sau khi tìm kiếm x và khởi động lại để tìm kiếm kẻ thù làng.
23=Thông báo khi tìm thấy Làng
24=Kiểm tra này nếu bạn muốn có một báo động âm thanh và một bảng Hiện ra khi một cơ sở để tấn công được tìm thấy.
25=các nút Start và Pause để bỏ qua những cơ sở chết hoặc tất cả các giá trị tìm kiếm cơ sở.
26=Cuộc Cấn Công Ngay! nút sẽ chỉ xuất hiện khi tìm kiếm các ngôi làng để tấn công.

[631]
631=***Section use for Tab Milking Attack***
0=Milking
2=Elixir Collectors Cấp độ Min. để Tấn công
3=Levels 1-4
4=Level 5
5=Level 6
6=Level 7
7=Level 8
8=Level 9
9=Level 10
10=Level 11
11=Level 12
13=Attack
14=Trong đó có 1 Lvl
16=Chỉ Tấn Công Nếu
17=Khoảng cách giữa kẻ đỏ và collectors
18=Attack Gold Mines Nếu Gold dưới
19=Attack Elixir Collectors Nếu Elixir dưới
20=Attack Dark Elixir Drills Nếu Dark dưới
21=4. Lính sử dụng Để Mỗi Công trình
22=- Lính mỗi sóng:
23=- Sóng Max:
24=- Sự chậm trễ giữa Sóng (ms):
25=5a. Snipe Bên ngoài TH Sau khi Milking
27=Max Gạch Từ biên giới
28=Dùng Thuật toán
29=Snipe ngay cả Nếu Ko Collector có thể Milked
30=Sử dụng Tấn công scripted cho nhà hoang, này sẽ vô hiệu hóa tấn công tiêu chuẩn
31=Legend
32=0-4%
33=5-19%
34=20-74%
35=75-89%
36=90-100%
37=Debug
38=Hãy hình ảnh của từng vắt sữa với bù đắp
39=tìm kiếm full, chỉ cho mục đích gỡ lỗi (rất chậm)
40=C - Tấn công
41=Hãy hình ảnh của làng
48==
50=Sức Nhẫn
51=Nhẫn Bình thường
52=Nhẫn Mạnh mẽ
53=Nhẫn Phá hủy
56=Cấu trúc Để Tấn công
57=D - Sau khi Milking
58=Nâng cao
59=Chậm: Kiểm tra các tài nguyên trong từng collector.
60=Nhanh: Chỉ kiểm tra các cấp độ của mỗi collector.
61=Kiểm tra Cấu trúc Bị Phá hủy
62=Kiểm tra Cấu trúc Phá hủy Trước Sóng
63=Trước khi tấn công một cấu trúc, kiểm tra xem nó đã bị phá hủy bởi sóng khác.
64=Bạn phải có một sự chậm trễ cao giữa sóng để sử dụng tùy chọn này
65=Kiểm tra Cấu trúc Phá hủy Sau Sóng
66=Sau khi tấn công một cấu trúc, kiểm tra xem nó đã bị phá hủy bởi sóng khác.
67=Bạn phải có một sự chậm trễ cao giữa sóng để sử dụng tùy chọn này
68=Cài đặt khoan dung
71=5. Tùy chọn thả
72=Thả từng Goblin ở cùng địa điểm
73=Thả từng Goblin tại một nơi khác
74=Thứ tự Tấn công: như được tìm thấy
75=Thứ tự Tấn công: Ngẫu nhiên
76=Thứ tự Tấn công: bên cạnh
77=B - Điều kiện
78=A - Cấu trúc
79=DIS.
80=Chọn Loại Milking Tìm kiếm
81=với các tùy chọn này, bạn có thể phát hiện hình ảnh của không bị phát hiện Elixir Vắt
82=Bật TH Snipe
83=Bật Tấn công Scripted
84=5b. Tiếp tục với 1 Tấn công Scipted
85=Chọn số lượng tối đa của sóng của quân để thả tại mỗi collector.
86=Nếu bộ thu bị tiêu diệt, sau đó không có sóng nhiều hơn sẽ được giảm xuống vào nó.

[632]
632=***Phần sử dụng cho Tab thống kê số liệu***
0=TH Level:
1=Thống kê
2=Bắt đầu với
3=Báo cáo
4=sẽ xuất hiện
5=đây trên
6=chạy đầu tiên.
7=Lượng Gold bạn có khi bắt đầu bot.
8=Lượng Elixir bạn có khi bắt đầu bot.
9=Số lượng của Dark Elixir bạn có khi bắt đầu bot.
10=Số lượng Cup bạn có khi bắt đầu bot.
11=Được
12=Số lượng Gold bạn đã đạt được về cuộc tấn công cuối cùng.
13=Số lượng Elixir bạn đã đạt được về cuộc tấn công cuối cùng.
14=Số lượng Dark Elixir bạn đã đạt được về cuộc tấn công cuối cùng.
15=Số lượng Cup bạn đạt được hoặc bị mất về cuộc tấn công cuối cùng.
16=Giải thưởng
17=Lượng Gold Thưởng bạn đã đạt được về cuộc tấn công cuối cùng.
18=Lượng Elixir Thưởng bạn đã đạt được về cuộc tấn công cuối cùng.
19=Lượng Dark Elixir Thưởng bạn đã đạt được về cuộc tấn công cuối cùng.
20=Tổng thu được
21=Tổng số Gold mà bạn đã đạt được hoặc bị mất trong khi Bot đang chạy.
22=(Bao gồm chi tiêu của các nguồn lực về nâng cấp các công trình)
23=Tổng số Elixir bạn đã đạt được hoặc bị mất trong khi Bot đang chạy.
24=Tổng số Dark Elixir bạn đã đạt được hoặc bị mất trong khi Bot đang chạy.
25=Số Cup bạn đạt được hoặc bị mất trong khi Bot đang chạy.
26=Được mỗi giờ
27=Gold tăng mỗi giờ
28=Elixir tăng mỗi giờ
29=Dark Elixir tăng mỗi giờ
30=Cup tăng mỗi giờ
31=Reset Stats
32=Thống kê: Misc
33=Tấn công
34=Các số của làng bị tấn công bởi Bot.
35=Bỏ qua
36=Các số của làng đó đã bị bỏ qua trong quá trình tìm kiếm bởi Bot.
37=UPG. by Gold
38=Các số của Walls nâng cấp bằng vàng.
39=Upg. by Elixir
40=Các số của Walls nâng cấp bởi Elixir.
41=Số lượng tòa nhà nâng cấp sử dụng vàng
42=Số lượng tòa nhà nâng cấp sử dụng elixir
43=Hero Upgrade
44=Số lượng các Hero nâng cấp
45=Giảm
46=Số lượng Bot giảm Cup do Cài đặt Cup (trên tab Linh tinh).
47=Thời gian Chạy
48=Tổng thời gian chạy của Bot.
49=Upg. Cost Gold
50=Chi phí của Gold được sử dụng bởi bot trong khi nâng cấp tường
51=UPG. Cost Elixir
52=Chi phí của Elixir được sử dụng bởi bot trong khi nâng cấp tường
53=Chi phí của Gold được sử dụng bởi bot trong khi nâng cấp các công trình
54=Chi phí của Elixir được sử dụng bởi bot trong khi nâng cấp các công trình
55=Upg. Cost DElixir
56=Chi phí của Dark Elixir được sử dụng bởi bot trong khi nâng cấp Hero
57=Nbr of OoS
58=Số lỗi Out of Sync xảy ra
59=Search Cost
60=Chi phí tìm kiếm bỏ qua các làng bằng Gold
61=Train Cost Elixir
62=Elixir dành cho việc huấn luyện quân Barrack
63=Train Cost DElixir
64=Dark Elixir dành cho đào tạo quân Dark Barrack
65=Gold collected
66=Gold đã đạt được bằng cách thu thập các mỏ
67=Elixir collected
68=Elixir đã đạt được bằng cách thu thập các mỏ
69=DElixir collected
70=Dark Elixir đã đạt được bằng cách thu thập khoan
71=Nhà Hoang
72=Tấn công
73=Các số Nhà hoang bị tấn công bởi Bot.
74=thu được
75=Số Lượng Gold thu được từ tấn công Nhà Hoang bởi Bot.
76=Số Lượng Elixir thu được từ tấn công Nhà Hoang bởi Bot.
77=Số Lượng Trophy thu được từ tấn công Nhà Hoang bởi Bot.
78=Nhà Sống
79=Các số nhà sống bị tấn công bởi Bot.
80=Số Lượng Gold thu được từ tấn công Nhà Sống bởi Bot
81=Số Lượng Elixir thu được từ tấn công Nhà Sống bởi Bot.
82=Số Lượng Dark Elixir thu được từ tấn công Nhà Sống bởi Bot.
83=Số Lượng Cup thu được từ tấn công Nhà Sống bởi Bot.
84=TH Bully
85=Số cơ sở TH Bully bị tấn công bởi Bot.
86=Số Lượng Gold thu được từ tấn công các base TH Bully bởi Bot.
87=Số Lượng Elixir thu được từ tấn công base TH Bully bởi Bot.
88=Số Lượng Dark Elixir thu được từ tấn công base TH Bully bởi Bot.
89=Số Lượng Cup thu được từ tấn công base TH Bully bởi Bot.
90=TH Snipe
91=Số Lượng Gold thu được từ tấn công các base TH Snipe bởi Bot.
92=Số Lượng Elixir thu được từ tấn công các base TH Snipe bởi Bot.
93=Số Lượng Dark Elixir thu được từ tấn công các base TH Snipe bởi Bot.
94=Số Lượng Cup thu được từ tấn công các base TH Snipe bởi Bot.
95=Số lượng TH Snipes thành công
96=Số lượng TH Snipe thất bại
97=ở đây khi
98=mỗi attack
99=sẽ cập nhật
100=Lượng Dark Elixir thu được từ tấn công Nhà Hoang bởi Bot.
101=Các số tấn công của TH Snipes bởi Bot.
102=Tấn công Cuối
103=Thực hiện Nâng cấp
104=Chi phí Nâng cấp
105=Chạy:
106=League
107=Thống Kê
108=Gold
109=Elixir
110=DarkE
111=Cup
112=Top Loot
113=Top Gold thu được
114=Top Elixir thu được
115=Top Dark thu được
116=Top Trophy thu được
117=Chi phí && Thu gom
118=Quân Đội
120=Tổng Donated
121=XP Won
119=Spells
122=Smart Zap
124=Số lượng của Dark Elixir thắng khi hạ gục
125=Số lượng của Lightning Spells được sử dụng để đánh
123=Sử dụng
126=Số lượng của Earthquake Spells được sử dụng để đánh
127=Elixir Troops
128=Dark Elixir Troops
129=Elixir Spells
130=Dark Elixir Spells

[633]
633=***Phần sử dụng cho Tab tùy chọn cuối Trận đấu ***
1=Chia sẻ Xem lại
2=Chia sẻ xem lại trong trò chuyện Clan của bạn.
3=Kiểm tra này để chia sẻ phát lại chiến của bạn trong trò chuyện clan.
4=Khi Tài nguyên Đạt
5=Chỉ chia sẻ xem lại khi cuộc chiến cướp là nhiều hơn so với lượng Gold.
6=Chỉ chia sẻ xem lại khi cuộc chiến cướp là nhiều hơn so với lượng Elixir.
7=Chỉ chia sẻ xem lại khi cuộc chiến cướp là nhiều hơn so với lượng Dark Elixir.
8=Sử dụng tin nhắn ngẫu nhiên từ danh sách này
9=Nice\r\nGood\r\nThanks \r\nWowwww
10=Gửi tin nhắn với chia sẻ xem lại
11=Hãy Chụp ảnh Cướp
12=Kiểm tra này nếu bạn muốn lưu một bản chụp cướp của làng bị tấn công.
13=Bao gồm thông tin cướp trong tên tập tin
14=Bao gồm thông tin cướp trong tên tập tin ảnh chụp màn hình

[634]
634=***Phần sử dụng cho Tab tùy chọn tấn công***
1=Kỹ năng Hero
2=Auto activate (red zone)
3=Kích hoạt kỹ năng khi các Hero trở nên yếu.
4=Heroes được kiểm tra và kích hoạt riêng.
5=Timed sau
6=Kích hoạt các kỹ năng trên một giờ.
7=Tất cả các anh hùng được kích hoạt cùng một lúc.
8=Cài đặt thời gian trong vài giây cho thời gian Kích hoạt các kỹ năng Hero.
9=Buộc sau
10=Sử dụng kỹ năng của Grand Warden trên một giờ.
11=Cài đặt thời gian trong vài giây cho Thời gian kích hoạt Kỹ năng của Grand Warden.
12=Nhà Clan Castle
13=Cân Bằng Donate/Receive
14=Thả nhà Clan Castle của bạn chỉ khi bạn Cho/Nhận tỷ lệ lớn hơn tỷ lệ D/R dưới đây.
15=Tỷ lệ Donated
16=Tỷ lệ Muốn donated / received
17=1/1 có nghĩa cho = nhận, 1/2 có nghĩa là tặng = một nửa nhận, vv
18=Tỷ lệ Received
20=Lịch Tấn công
21=Kích hoạt Lịch Trình
22=Tùy chọn này sẽ cho phép bạn lên lịch giờ tấn công
23=Bot tiếp tục chạy và sẽ chỉ tấn công khi lịch trình cho phép
24=Đóng CoC
25=Tùy chọn này sẽ đóng ứng dụng CoC khi không lên kế hoạch tìm và tấn công!
26=Bot tiếp tục chạy và sẽ khởi động lại khi lịch trình cho phép
27=Đóng Giả lập
28=Tùy chọn này sẽ đóng giả lập khi không lên kế hoạch tìm và tấn công!
29=Tự vô hiệu hóa
30=Tùy chọn này sẽ ngẫu nhiên ngừng tấn công
31=Chọn số giờ bạn muốn ngừng tấn công
32=
33=
34=
35=Daily Limit
36=Ngẫu nhiên sẽ ngừng tấn công khi vượt quá con số ngẫu nhiên của các cuộc tấn công giữa phạm vi lựa chọn
37=Nhập số lượng tối thiểu của các cuộc tấn công được cho phép mỗi ngày
38=Nhập số lượng tối đa của các cuộc tấn công được cho phép mỗi ngày
39=to
40=Bật Lịch Thả Clan Castle
41=Sử dụng lịch trình để xác định khi thả Clan Castle được cho phép, \r\n Clan Castle luôn giảm khi lịch trình không được kích hoạt

[635]
635=***Phần sử dụng cho Tạo Scripted tấn công***
1=Tạo Mới Tập tin Script
2=Tên Tập tin Scrip Mới
3=Tập tin tồn tại, xin vui lòng nhập vào một tên mới
4=Có lỗi xảy ra khi tạo tập tin.
5=Sao chép đến tập tin Scrip mới
6=Sao chép
7=đến Tên Tập tin Scrip Mới

[636]
636=***Phần sử dụng cho Tab Bot Tùy chọn***
2=Khi Tải Bot
3=Kiểm Tra Cập Nhật
4=Kiểm tra nếu bạn đang chạy phiên bản mới nhất của bot.
5=Xóa Tập Tin Nhật Ký
6=Xóa tập tin nhật kí lớn hơn số quy định của ngày.
7=ngày
8=Xóa Tập Tin Temp
9=Xóa các file tạm lớn hơn số quy định của ngày.
10=Xóa Hình Ảnh Cướp
11=Xóa các tập tin hình ảnh cướp nhiều hơn số quy định của ngày.
12=Khi Bot Bắt Đầu
13=Tự Động Start sau
15=Kiểm tra ngôn ngữ trò chơi (EN)
16=Kiểm tra xem các trò chơi được thiết lập với ngôn ngữ chính xác (Phải được thiết lập Tiếng Anh).
17=Tự động căn
18=Đặt lại vị trí/Căn Giả lập  Android và cửa sổ BOT trên màn hình.
19=Bù lại
20=Bù đắp điểm ảnh theo chiều ngang giữa Giả lập Android và cửa sổ BOT.
21=Bù đắp điểm ảnh theo chiều dọc giữa Giả lập Android và cửa sổ BOT.
22=0,0: Giả lập Android-Bot
23=0,0: Bot-Giả lập Android
24=SNAP: Bot Trên Bên phải Android
25=SNAP: Bot Trên Bên trái Android
26=SNAP: Bot Dưới Bên phải Android
27=SNAP: Bot Dưới Bên trái Android
28=0,0: Đổi vị trí màn hình Giả lập Android đến vị trí 0,0 trên windows và sắp xếp cửa sổ Bot phải hoặc trái để nó.
29=SNAP: Chỉ sắp xếp lại các windows, của sổ Align Bot để cửa sổ Giả lập Android tại Tren Phải, Trên Trái, Dưới Phải hay Dưới Trái.\r\nDOCK: Tích hợp Màn hình Android vào cửa sổ bot.
30=Thời gian Click Đào tạo
31=Đào tạo Lính
32=Delay
33=Tăng chậm trễ nếu máy tính của bạn chậm hoặc để tốc độ nhấp chuột tạo ra như con người đào tạo
34=Debug
35=Debug: Viết nhấp (x,y) phối hợp với các nhật ký.
36=Debug: Cho phép bật debug SetLog trong mã cho khắc phục sự cố.
37=Debug: Cho phép hình ảnh OCR lưu cho xử lý sự cố.
38=Debug: Cho phép hình ảnh lưu cho xử lý sự cố.
39=Debug: Cho phép thể hiện vị trí của các tòa nhà trong nhật ký.
40=Click
41=Tin nhắn
42=OCR
43=Hình ảnh
44=Các Công Trình
45=Lựa Chọn Khác
46=Tổng Lượng Trại Lính
47=Nếu không được phát hiện thiết lập các giá trị trại quân đội (thay vì yêu cầu)
55=Tùy chọn Ảnh chụp màn hình 
56=Hãy ở định dạng PNG
57=Ẩn Tên ngôi làng và Nhà Clan Castle
58=Tự động BẮT ĐẦU Bot sau khi số giây này.
61=Buộc Thoát Khi PB
62=Bot Buộc thoát CoC một thời gian trước khi bắt đầu bình thường của Personal Break
63=Gõ vào số phút để giữ đóng CoC. Thiết lập tối thiểu để 15 phút để thiết lập lại Personal Break đếm thời gian!
65=Trừ thời gian để thoát PB
66=Gõ vào số phút để đóng CoC sớm! Cài đặt dưới 10 phút có thể không hoạt động!
71=Khởi động lại Bot để tải chương trình với ngôn ngữ mới:
72=Tùy chọn
73=Đào tạo
74=Debug: Cho phép hiện gỡ lỗi trong quá trình đào tạo.
75=Chậm trễ Tìm Kiếm Làng
76=Sử dụng thanh trượt này để thay đổi thời gian chờ đợi giữa các nhấp chuột Next khi tìm kiếm một ngôi làng để tấn công.
77=Điều này có thể bù đắp cho lỗi không đồng bộ (OoS) trên một số máy tính.
78=KHÔNG BẢO ĐẢM! Điều này sẽ luôn luôn không có kết quả tương tự!
80=Max
81=Kích hoạt tính năng ngẫu nhiên tìm kiếm làng chậm trễ bằng cách thiết lập
82=dưới giá trị trượt Max cao hơn giá trị tối thiểu 
83=GUI ngôn ngữ
84=Sử dụng điều này để chuyển sang một ngôn ngữ giao diện khác nhau
85=Thiết Bị Từ Xa
86=Khi 'thiết bị khác' chờ đợi
87=Nhập thời gian để chờ đợi (trong phút) trước khi Bot kết nối lại khi một thiết bị khác nắm quyền kiểm soát.
88=Test Train
89=Test Donate
90=Test Attack Bar
91=Online debug donations
92=Debug: make ocr of donations and simulate only donate but no donate any troop
93=Nâng cao
94=Click Ngẫu nhiên
95=DOCK: Android vào Bot
96=Đang cập nhật khi giảm thiểu
97=Kích hoạt tính năng giảm thiểu thói quen khác nhau cho cửa sổ bot.\r\nKhi bot được giảm thiểu, cập nhật màn hình được thể hiện trong bản xem trước thanh tác vụ.
98=Ẩn khi giảm thiểu
99=Ẩn cửa sổ bot trong thanh tác vụ khi giảm thiểu.\r\nDùng Biểu tượng trên khay 'Hiện bot' để hiển thị cửa sổ bot.
100=Vô hiệu hóa màn hình Splash
101=Vô hiệu hóa màn hình khởi động.
102=Test Click Drag (scrolling)
103=Test Image
104=Phát Hiện Lượng Clan Castle
105=Nếu Clan Castle nó là không bị phát hiện và nó là không được đặt trong các khe cuối cùng, lượng bot để xem xét các khe cắm không bị phát hiện như Clan Castle
106=Attack CSV
107=Debug: Generates special CSV parse log files
108=Attack CSV Image
109=Debug: Enables saving clean and location marked up images of bases attacked by CSV scripts
110=Test Request
111=Test Village Size
112=Disable Zoomout
113=Debug: Disables zoomout of village.
114=Disable Village Centering
115=Debug: Disables centering of village.
116=Test Dead Base Folder
117=Debug: Saves images of skipped deadbase villages.
118=Test Find Button
119=Test Clean Yard
120=Test Dead Base
121=Test Attack CSV
122=Auto resume Bot sau
123=Điều này sẽ tự động tiếp tục bot của bạn sau khi x phút
202=Tự Động ẨN sau
203=Tự động ẨN Bot sau khi số giây này.

[637]
637=***Phần sử dụng cho Tab Bot hồ sơ***
1=Chuyển đổi Profiles
2=Sử dụng để chuyển sang một profile khác
3=Profiles của bạn có thể được tìm thấy trong
4=MyVillage
5=Tên làng/profile's của bạn
6=Thêm mới Profile
7=Xác nhận
8=Xóa Profile
9=Hủy bỏ
10=Đổi tên Profile
11=Profile đã Có sẵn
12=%s đã tồn tại.\r\nVui lòng chọn tên cho profile của bạn.
14=Bạn có chắc chắn rằng bạn thực sự muốn xóa profile không?\r\nHành động không thể được hoàn tác.

[640]
640=***Phần sử dụng cho tất cả Popups***
1=Ok|Cancel
2=Lỗi Cài đặt Hiển thị
3=DPI không chính xác
4=DPI của bạn là không chính xác. Nó được thiết lập để
5=%. Bạn phải thiết lập nó để 100% cho bot này làm việc.
6=Khi bạn đã thay đổi DPI với giá trị chính xác, khởi động lại máy tính của bạn và chạy bot nữa.
7=Bạn sẽ không thể sử dụng bot cho đến khi bạn thực hiện thay đổi này.
8=Nhấn OK để xem hướng dẫn về cách thay đổi DPI
9=Không được hỗ trợ
10=Rất tiếc, hệ điều hành của bạn không được hỗ trợ bởi các bot.
11=Chào bạn, chúng ta đang thiếu một số tập tin!
12=Xin hãy giải nén tất cả các file và thư mục và bắt đầu chương trình này một lần nữa!
13=Xin lỗi, nút Bắt đầu bị vô hiệu hóa cho đến khi được cố định!
14=Ok
15=Chào bạn, tên tập tin không chính xác!
16=Bạn đã đổi tên các tập tin "MyBot.run.exe"! Vui lòng thay đổi nó trở lại MyBot.run.exe và khởi động lại bot!
17=MyBot đã trải qua một lỗi nghiêm trọng
18=Không thể tìm thấy hoặc bắt đầu lên
19=và tìm kiếm diễn đàn www.mybot.run để được giúp đỡ nhiều hơn nữa
20=Đóng MyBot!
21=Được rồi - Phải thoát khỏi chương trình
22=Khởi động lại máy tính và thử lại,
23=Trại lính
24=Quân lính
25=Nhấn OK sau đó bấm vào một trong của bạn
26=Không di chuyển chuột một cách nhanh chóng sau khi nhấp vào vị trí
27=Hãy chắc chắn rằng tên tòa nhà có thể nhìn thấy đối với tôi!
28=Định vị
29=Câu hỏi
30=Bạn có bao nhiêu barrack?
31=Nhập Khái quát Quân lính Tab Vị trí của Barrack này [1|2|3|4] :
32=Nhấn OK sau đó nhấn vào nhà Clan Castle của bạn
33=Xác định vị trí Clan Castle 
34=Nhấn OK sau đó nhấn vào Queen Altar của bạn
35=Định vị Queen Altar
36=OK
37=Để ý
38=Bây giờ bạn có thể loại bỏ chuột ra khỏi Giả lập Android, Cảm ơn!!
39=Nhấn OK sau đó nhấn vào King Altar của bạn
40=Xác định vị trí King Altar
41=Nhấn OK sau đó nhấn vào Grand Warden Altar của bạn
42=Xác định vị trí Drand Warden Altar
43=Nhấn OK sau đó nhấn vào công trình Laboratory của bạn
44=Xác định vị trí Laboratory
45=Nhấn OK sau đó nhấn vào Spell Factory của bạn
46=Xác định vị trí Spell Factory
47=Xác định vị trí Dark Spell Factory
48=Nhấn OK sau đó nhấn vào Dark Spell Factory của bạn
49=Nhấn OK sau đó nhấn vào TownHall của bạn
50=Xác định vị trí TownHall
51=Nhấp vào nút 'Xác định vị trí Công trình' sau đó nhấn vào các Công trình/Hero của bạn để nâng cấp.
52=Nhấn vào nút 'Hoàn tất' khi hoàn vị tất cả các nâng cấp.
53=Nhấn vào Hủy để thoát khỏi việc tìm kiếm các tòa nhà
54=Xác định vị trí Công trình|Xong|Hủy
55=Xác định vị trí Nâng Cấp
56=Lỗi đọc Văn bản
57=Nhập chi phí của việc nâng cấp
58=Lưu bản sao của hình ảnh nâng cấp để phân tích phát triển?
59=YES|NO
60=   GOLD   |  ELIXIR  |DARK ELIXIR
61=Cần người giúp
62=Chọn Loại Nâng cấp:
63=Nhấn OK để Xóa và Thiết lập lại tất cả các thông tin Công trình,
64=LƯU Ý = >> Bot sẽ thoát ra và cần phải được khởi động lại khi hoàn thành
65=Hoặc Nhấn Cancel để thoát
66=Xóa Và Exit|Cancel
67=Xóa Thông Tin Công trình ?
68=Bạn có chắc chắn 100% bạn muốn xóa thông tin Công trình ?
69=Nhấn OK để xóa và sau đó khởi động lại bot (bằng tay)
70=Xóa Cấu hình
71=Bạn có chắc chắn muốn xóa các cấu hình ?
72=Nếu bạn định vị TH của bạn vì bạn đã nâng cấp,
73=sau đó bạn phải khởi động lại bot !!!
74=Nhấn OK để khởi động lại bot,      
75=Exit|Cancel
76=Vui lòng Đóng Bot!
77=Bạn có chắc chắn bạn muốn khởi động lại bot ?
78=Nhấn OK để đóng bot và sau đó khởi động lại bot (bằng tay)

[641]
641=***Phần sử dụng cho quân đội đào tạo Tùy chọn***
1=Tùy Chọn
2=Đào tạo thời gian nhàn rỗi
3=Đóng Trong Khi Đào tạo
4=Tùy chọn sẽ thoát CoC cho thời gian cần thiết để hoàn thành đào tạo quân khi SHIELD ĐANG HOẠT ĐỘNG
5=Đóng để tạo Spell sẽ được kích hoạt khi 'Chờ Spells' được chọn vào tab Tìm Kiếm
6=Đóng cho Hero hồi máu sẽ được kích hoạt khi 'Chờ Heroes' được kích hoạt trên Tab Tìm Kiếm
7=Nếu Ko Có Shield
8=Tùy chọn này sẽ luôn luôn đóng CoC cho thời gian đào tạo nhàn rỗi khi SHIELD KHÔNG HOẠT ĐỘNG!
9=Lưu ý - Bạn có thể bị tấn công và mất Cup khi tùy chọn này được kích hoạt!
10=Đóng Ngẫu Nhiên
11=Lựa chọn ngẫu nhiên sẽ lựa chọn giữa thời gian thoát, đóng CoC, hoặc Đóng giả lập khi lựa chọn
12=
13=Đóng Giả Lập
14=Tùy chọn này sẽ đóng hoàn toàn Giả lập Android khi được chọn
15=Thêm tùy chọn này có thể làm tăng thời gian ẩn nhẹ do mất thời gian cần thiết để khởi động
16=Thời Gian Chuẩn
17=Chọn để chờ đợi thời gian chính xác cần thiết cho quân đội để hoàn thành đào tạo
18=Chọn bao nhiêu thời gian để chờ đợi khi tính năng cho phép
19=Time Ngẫu Nhiên
20=Chọn thêm một thời gian chờ đợi ngẫu nhiên như con người quên clash
21=Nhập tỷ lệ % tối đa thêm thời gian để được sử dụng tạo ra thời gian chờ ngẫu nhiên,
22=Bot sẽ tính toán một thời gian chờ đợi ngẫu nhiên giữa thời gian chính xác cần thiết, và
23=Tối đa ngẫu nhiên như % nhập vào xuất hiện nhiều hơn như con người
25=Đào tạo theo thứ tự
24=Nhập để tự đào tạo
27=Kích hoạt tính năng để lựa chọn một thứ tự về quân
28=Thay đổi thứ tự đào tạo có thể hữu ích với CSV kịch bản quân đội tấn công!
29=Nhập để tự đào tạo của quân #
26=Tuỳ chỉnh Thứ tự
30=Áp dụng Thứ tự Mới
31=Nút đẩy khi lựa chọn thứ tự đào tạo quân tùy chỉnh xong
32=Biểu tượng thay đổi màu sắc dựa trên trạng thái: Đỏ = Không được thiết lập, Xanh = Đã được thiết lập
33=Tuỳ chỉnh Thứ tự Dark
34=Kích hoạt tính năng để tùy chỉnh lựa chọn huấn luyện về quân dark
35=Thêm Delay Training Ngẫu Nhiên
36=Add Delay Ngẫu Nhiên
37=Thêm delay ngẫu nhiên giữa hai cuộc gọi của trại quân đội.
38=Tùy chọn này làm giảm các cuộc gọi đến các cửa sổ đào tạo nhân bản khoảng cách bot gọi mỗi lần với một khoảng thời gian nhân quả lựa chọn giữa tối thiểu và tối đa các giá trị chỉ ra dưới đây.
39=Giữa
40=Và
41=Time Tối Thiểu Phải Đóng
42=Sẽ được đóng CoC Nếu thời gian đào tạo quân đội >= (Thời gian tối thiểu cần thiết để đóng)\r\nChỉ cần ở trong màn hình chính nếu thời gian đào tạo quân đội < (Thời gian tối thiểu cần thiết để đóng)
43=Nhập số thời gian tối thiểu để đóng CoC trong vài phút mà bạn muốn, Mặc định là (2)

[642]
642=***Section use for Distributors***
1=No COC
2=Unknown COC
11=Google
12=Kunlun
13=Qihoo
14=Baidu
15=9game
16=Wandoujia/Downjoy
17=Huawei
18=OPPO
19=VIVO
20=Anzhi
21=Kaopu
22=Lenovo
23=Guopan
24=Xiaomi
25=Haimawan
26=Leshi
27=Microvirt
28=Yeshen
29=Aiyouxi

[643]
643=***Section use for Tab Bot Android***
1=Distributors
2=Allow bot to launch COC based on the distribution chosen

[644]
644=***Section use for Hero***
1=King
2=Queen
3=G.Warden

[1000]
1=Đào tạo Lính
2=Nấu Spells
3=Tùy chọn Đào tạo | Thời Gian | Chi Phí

[638]
1=SmartZap/NoobZap
2=Sử Dụng Spell này để Zap Dark Drills
3=Dùng LSpells
4=Kiểm tra này để thả Lightning Spells trên đầu của Dark Elixir Drills.
5=Hãy nhớ để đi đến tab 'lính' và đưa công suất tối đa
6=hoặc sản xuất spell của bạn và số lượng của các spells để các bot có thể hoạt động hoàn hảo.
7=Dùng EQSpell
8=Kiểm tra này để thả EarthQuake Castle Spell trên bất kỳ Dark Elixir Drill
9=Dùng NoobZap
10=Kiểm tra này để thả lightning spells trên bất kỳ Dark Elixir Drills
11=Chỉ Zap Drills trong Nhà Hoang
12=Điều này sẽ chỉ SmartZap một Nhà Hoang (Đề Xuất)
13=TH Snipe Không Zap nếu Triển Khai Heroes
14=Điều này sẽ ngăn chặn SmartZap từ zapping một base trên một Town Hall Snipe nếu Heroes của bạn đã được triển khai
15=Số lượng Min. của Dark Elixir
16=Thiết lập giá trị tối thiểu của số tiền của Dark Elixir trong Drills
17=Tăng thu của Dark Drills
18=Đặt giá trị cho lợi ích dự kiến mỗi dark drill
19=NoobZap sẽ được dừng lại nếu zap cuối cùng đã đạt được ít DE hơn dự kiến
20=Số lightning spells đã sử dụng
21=Số EarthQuake Spell đã sử dụng
22=Số của dark elixir đã giật được trọng vụ tấn công bằng lightning
23=Debug SmartZap
24=Sử dụng điều này để gỡ lỗi SmartZap

[42]
100=Never|Sometimes|Frequently|Often|Very Often
0=Bật Bot Humanization
1=Make ALL BOT clicks random
2=Cài đặt
3=Đọc Clan Chat
4=Đọc Global Chat
5=Nói...
6=Hello !
7=Or
8=Re !
9=Launch Challenges with message
10=Can you beat my village ?
11=Xem Phòng Thủ
12=Xem Tấn Công
13=Max Replay Speed
14=Pause Replay
15=Xem War log
16=Thăm Clanmates
17=Nhìn vào Best Players
18=Nhìn vào Best Clans
19=Nhìn vào Current War
20=Xem Replays
21=Do nothing
22=Max Actions by Loop
23=Thu thập tự động những thành tựu
24=Nhìn vào màu đỏ/cờ tím trên nút

[671]
1=SmartUpgrade
2=Bật SmartUpgrade
3=Hộp kiểm tra để cho phép tự động bắt đầu nâng cấp từ menu xây dựng
4=Nâng cấp để bỏ qua
5=Gold to save
6=Elixir to save
7=Dark to save
8=... after launching upgrade
9=--------------------------------------------- SMART UPGRADE LOG ---------------------------------------------

[800]
1=Enable
50=Kiểm tra để tự động cho phép thu thập Treasury
2=Luôn thu Treasury
51=Kiểm tra để buộc thu nhập Treasury\r\nTreasury sẽ được thu thập tất cả các thời gian, bỏ qua bất kỳ tiêu chí
3=Thu Khi Gold <
52=Khi Làng của bạn có Gold thấp hơn giá trị này, nó sẽ thu thập Treasury
4=Khi Đầy
53=Khi mức Gold của bạn trong Treasury là đầy đủ, nó sẽ thu thập nó để trống Treasury
5=Thu Khi Elixir <
54=Khi Làng của bạn có Elixir thấp hơn giá trị này, nó sẽ thu thập Treasury
6=Khi Đầy
55=Khi mức Elixir của bạn trong Treasury là đầy đủ, nó sẽ thu thập nó để trống Treasury
7=Thu Khi Dark <
56=Khi Làng của bạn có Dark thấp hơn giá trị này, nó sẽ thu thập Treasury
8=Khi Đầy
57=Khi mức Dark của bạn trong Treasury là đầy đủ, nó sẽ thu thập nó để trống Treasury
100=Enable Persian Alphabet Recognition for Donations
101=Check this to enable the Persian Alphabet Recognition.

[700]
1=Goblin XP
2=Enable Goblin XP
3=Farm XP during troops Training
13=LOCKED
4=Farm XP instead of Attacking
14=Max XP to Gain
5=Use
6=to gain XP
7=XP at Start
8=Current XP
9=XP Won
10=XP Won/Hour
11=Goblin XP attack continuously the TH of Goblin Picnic to farm XP.
12=At each attack, you win 5 XP

[108]
1=Chuyển Accounts Thông Minh
2=Use Smart Switch Accounts
3=Số lượng tài khoản trên Emulator :
4=Dùng Account 1 với Profile :
5=Chỉ Donate
6=Dùng Account 2 với Profile :
7=Dùng Account 3 với Profile :
8=Dùng Account 4 với Profile :
9=Dùng Account 5 với Profile :
10=Dùng Account 6 với Profile :
11=Dùng Account 7 với Profile :
12=Dùng Account 8 với Profile :

[109]
1=Chọn kiểu chuyển TK:
2=Chuyển tài khoản phiên bản DocOc
3=Chuyển tài khoản phiên bản Demen
5=Chế Độ Chuyển Tài Khoản
6=Bật chế độ chuyển tài khoản
7=Chuyển sang tài khoản & profile khác khi thời gian đào tạo quân là >= 1 phút
8=Chức năng này hỗ trợ tối đa 8 tài khoản CoC & 8 Bot profiles
9=Đảm bảo tạo đủ Profiles bằng số Tài khoản CoC
10=Tổng số TK:
11=Chọn số Tài khoản CoC đã đăng nhập
12=Tuần tự
13=Chuyển đổi tài khoản xoay vòng theo thứ tự
14=Thông minh
15=Chuyển sang tài với thời gian tạo lính ngắn nhất
16=Tạm dừng sau khi chuyển TK
17=Tắt CoC/Giả lập sau khi chuyển tài khoản nếu thời gian đào tạo lính còn nhiều hơn 3 phút
18=Tắt CoC
19=Tắt Android
20=Xác định tọa độ tài khoản thủ công
21=Chọn Tài khoản để xác định tọa độ
22=Định vị
23=Bắt đầu xác định tọa độ tài khoản
24=Xóa hết
25=Xóa dữ liệu tọa độ tất cả các tài khoản
26=Profiles
27=Cập nhật Profiles
28=Clear Profiles
29=Stt
30=Tên Profile
31=TK
32=Kiểu Bot
33=Tên Làng
34=Chọn Tài khoản CoC kết hợp với Profile này
35=Chọn kiểu auto cho Profile này
36=Active
37=Donate
38=Nghỉ
39=Chế Độ SwitchAcc
40=Không thể kích hoạt chế độ chuyển tài khoản
41=Chỉ có 
42=Tài khoản [
44=] đã kết hợp với Profile Số [
45=Xác định tọa độ Tài khoản Số. 
46=, vui lòng chờ...
47=Click Connect/Disconnect trên giả lập để hiển thị danh sách tài khoản
48=Click OK sau đó nhấn vào Tài khoản cần định vị 
49=Giữ nguyên con trỏ chuột đứng yên 1 lúc sau khi nhấn
50=Ok|Hủy
51=Định vị Tài khoản CoC Số. 
52=Đã hủy xác định tài khoản CoC
53=Định vị Tài khoản CoC Thành công: 
54=Vị trí của tất cả tài khoản được xóa